In [2]:
import cx_Oracle
import sqlalchemy
from sqlalchemy.exc import SQLAlchemyError
import pandas as pd
import numpy as np

In [13]:
data = pd.read_csv('D://Master/SSP/Projekat/data/processed/ProcessedData.csv')

In [18]:
data.head()

,Id,Book Number,Booked By,Guest Name,Start Date,End Date,Booked On,Status,Rooms,Number Of People,...,Contact,Staff,Facilities,Cleanliness,Comfort,Value For Money,Location,Free WiFi,Accommodation Type,Number Of Nights
0,0,2245705225.0,Veeravalli Gopi,Gopi Veeravalli,03.04.2019,06.04.2019,30.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,NaN
1,1,2071623069.0,Kretov Nikita,Nikita Kretov,06.04.2019,11.04.2019,01.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,NaN
2,2,3037388122.0,Yuheng Huang,Yuheng Huang,07.04.2019,08.04.2019,31.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,C,NaN
3,3,3181654986.0,Li Fengju,Fengju Li,10.04.2019,11.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,D,NaN
4,4,3642008503.0,Li Fengju,NaN,11.04.2019,12.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,C,NaN

In [19]:
def write(df, query):
    try:
        with cx_Oracle.connect("odidata", "oracle", "localhost:1522/xe") as conn:
            with conn.cursor() as cursor:
                cursor.executemany(query, df)
            conn.commit()
    except cx_Oracle.DatabaseError as exc:
        print(exc)

In [20]:
def read(table_name):
    try:
        engine = sqlalchemy.create_engine("oracle+cx_oracle://odidata:oracle@localhost:1522/xe", arraysize=1000)
        query = f"""SELECT * FROM {table_name}""";
        df = pd.read_sql(query, engine)
    except SQLAlchemyError as e:
        print(e)
    return df

# Dim_Advertiser

In [21]:
advertiser = pd.DataFrame(data.Advertiser.dropna().unique(), columns=['name'])
advertiser.loc[len(advertiser)] = {'name': 'OLTP'}
advertiser['idadvertiser'] = range(1, len(advertiser) + 1)

In [22]:
advertiser = advertiser[advertiser.columns.tolist()[::-1]]

In [23]:
advertiser

   idadvertiser     name
0             1  Booking
1             2   Airbnb
2             3     OLTP

In [24]:
advertiser_to_list = list(advertiser.itertuples(index=False, name=None))

In [25]:
advertiser_to_list

[(1, 'Booking'), (2, 'Airbnb'), (3, 'OLTP')]

In [26]:
query_insert_advertiser = """INSERT INTO dim_advertiser (idadvertiser, name) VALUES (:1, :2)"""

In [34]:
write(advertiser_to_list, query_insert_advertiser)

ORA-00001: unique constraint (ODIDATA.DIM_ADVERTISER_PK) violated

# Dim_Apartment

In [27]:
data2 = pd.read_csv('D://Master/SSP/Projekat/data/processed/ProcessedData2.csv')

In [28]:
data_dim_apartment = data2.copy()
selected_columns = ['Rooms', 'Accommodation', 'Bed']
data_dim_apartment = data_dim_apartment[selected_columns]
data_dim_apartment

     Rooms                                    Accommodation  Bed
0      1.0  One-Bedroom Apartment with Balcony and Sea View    4
1      1.0  One-Bedroom Apartment with Balcony and Sea View    4
2      1.0                   Studio with Patio and Sea View    2
3      1.0    One-Bedroom Apartment with Patio and Sea View    4
4      1.0                   Studio with Patio and Sea View    2
..     ...                                              ...  ...
700    NaN    One-Bedroom Apartment with Patio and Sea View    4
701    NaN  One-Bedroom Apartment with Balcony and Sea View    4
702    NaN                   Studio with Patio and Sea View    2
703    NaN                   Studio with Patio and Sea View    2
704    NaN                   Studio with Patio and Sea View    2

[705 rows x 3 columns]

In [29]:
condition = data_dim_apartment['Accommodation'].str.contains('Studio with Patio|Studio with Patio and Sea View', case=False)
result = (data_dim_apartment[condition]['Bed'] == 2).all()

if result:
    print("Every Studio with Patio or Studio with Patio and Sea View has Bed value equal to 2.")
else:
    print("Not every Studio with Patio or Studio with Patio and Sea View has Bed value equal to 2.")

condition2 = data_dim_apartment['Accommodation'].str.contains('One-Bedroom Apartment with Balcony and Sea View|One-Bedroom Apartment with Patio and Sea View', case=False)
result2 = (data_dim_apartment[condition2]['Bed'] == 4).all()

if result2:
    print("Every One-Bedroom Apartment with Balcony and Sea View or One-Bedroom Apartment with Patio and Sea View has Bed value equal to 4.")
else:
    print("Not every One-Bedroom Apartment with Balcony and Sea View or One-Bedroom Apartment with Patio and Sea View has Bed value equal to 4.")

Every Studio with Patio or Studio with Patio and Sea View has Bed value equal to 2.
Every One-Bedroom Apartment with Balcony and Sea View or One-Bedroom Apartment with Patio and Sea View has Bed value equal to 4.

In [30]:
mapping = {'One-Bedroom Apartment with Balcony and Sea View' : 4,
           'Studio with Patio' : 2,
           'Studio with Patio and Sea View' : 2,
           'One-Bedroom Apartment with Patio and Sea View' : 4}

data_dim_apartment['Rooms'] = data_dim_apartment['Accommodation'].replace(mapping)
data_dim_apartment

C:\Users\k\AppData\Local\Temp\ipykernel_7412\1088906005.py:6: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data_dim_apartment['Rooms'] = data_dim_apartment['Accommodation'].replace(mapping)

     Rooms                                    Accommodation  Bed
0        4  One-Bedroom Apartment with Balcony and Sea View    4
1        4  One-Bedroom Apartment with Balcony and Sea View    4
2        2                   Studio with Patio and Sea View    2
3        4    One-Bedroom Apartment with Patio and Sea View    4
4        2                   Studio with Patio and Sea View    2
..     ...                                              ...  ...
700      4    One-Bedroom Apartment with Patio and Sea View    4
701      4  One-Bedroom Apartment with Balcony and Sea View    4
702      2                   Studio with Patio and Sea View    2
703      2                   Studio with Patio and Sea View    2
704      2                   Studio with Patio and Sea View    2

[705 rows x 3 columns]

In [31]:
data_dim_apartment = data_dim_apartment.drop_duplicates(subset='Accommodation')
data_dim_apartment

    Rooms                                    Accommodation  Bed
0       4  One-Bedroom Apartment with Balcony and Sea View    4
2       2                   Studio with Patio and Sea View    2
3       4    One-Bedroom Apartment with Patio and Sea View    4
62      2                                Studio with Patio    2

In [32]:
data_dim_apartment['idapartment'] = range(1, len(data_dim_apartment) + 1)
data_dim_apartment

C:\Users\k\AppData\Local\Temp\ipykernel_7412\2208670112.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_dim_apartment['idapartment'] = range(1, len(data_dim_apartment) + 1)

    Rooms                                    Accommodation  Bed  idapartment
0       4  One-Bedroom Apartment with Balcony and Sea View    4            1
2       2                   Studio with Patio and Sea View    2            2
3       4    One-Bedroom Apartment with Patio and Sea View    4            3
62      2                                Studio with Patio    2            4

In [33]:
new_column_order = ['idapartment', 'Rooms', 'Accommodation', 'Bed']
data_dim_apartment = data_dim_apartment[new_column_order]
data_dim_apartment

    idapartment  Rooms                                    Accommodation  Bed
0             1      4  One-Bedroom Apartment with Balcony and Sea View    4
2             2      2                   Studio with Patio and Sea View    2
3             3      4    One-Bedroom Apartment with Patio and Sea View    4
62            4      2                                Studio with Patio    2

In [34]:
data_dim_apartment_to_list = list(data_dim_apartment.itertuples(index=False, name=None))
query_insert_data_dim_apartment = """   INSERT INTO dim_apartment (idapartment, Room, name, Bed) VALUES (:1, :2, :3, :4)"""
write(data_dim_apartment_to_list, query_insert_data_dim_apartment)

ORA-00001: unique constraint (ODIDATA.DIM_APARTMENT_PK) violated

# Dim_Currency

In [35]:
dc = {'name' : ['RSD', 'EUR', 'DOLLAR']}
dim_currency = pd.DataFrame(dc)
dim_currency

     name
0     RSD
1     EUR
2  DOLLAR

In [36]:
dim_currency['idcurrency'] = range(1, len(dim_currency) + 1)
dim_currency

     name  idcurrency
0     RSD           1
1     EUR           2
2  DOLLAR           3

In [37]:
new_column_order = ['idcurrency', 'name']
dim_currency = dim_currency[new_column_order]
dim_currency

   idcurrency    name
0           1     RSD
1           2     EUR
2           3  DOLLAR

In [46]:
dim_currency_to_list = list(dim_currency.itertuples(index=False, name=None))
query_insert_dim_currency = """   INSERT INTO dim_currency (idcurrency, name) VALUES (:1, :2)"""
write(dim_currency_to_list, query_insert_dim_currency)

ORA-00001: unique constraint (ODIDATA.DIM_CURRENCY_PK) violated

# Dim_GradeCategory

In [38]:
gc = {'mingrade': [1,3,5,7,9, 0],
        'maxgrade': [2,4,6,8,10, 0],
        'category' : ['Very poor', 'Poor', 'Passable', 'Good', 'Superb', 'NotGraded']}

dim_gradeCategory = pd.DataFrame(gc)
dim_gradeCategory

   mingrade  maxgrade   category
0         1         2  Very poor
1         3         4       Poor
2         5         6   Passable
3         7         8       Good
4         9        10     Superb
5         0         0  NotGraded

In [39]:
dim_gradeCategory['idgradeCategory'] = range(1, len(dim_gradeCategory) + 1)
dim_gradeCategory

   mingrade  maxgrade   category  idgradeCategory
0         1         2  Very poor                1
1         3         4       Poor                2
2         5         6   Passable                3
3         7         8       Good                4
4         9        10     Superb                5
5         0         0  NotGraded                6

In [40]:
new_column_order = ['idgradeCategory', 'mingrade', 'maxgrade', 'category']
dim_gradeCategory = dim_gradeCategory[new_column_order]
dim_gradeCategory

   idgradeCategory  mingrade  maxgrade   category
0                1         1         2  Very poor
1                2         3         4       Poor
2                3         5         6   Passable
3                4         7         8       Good
4                5         9        10     Superb
5                6         0         0  NotGraded

In [41]:
dim_gradeCategory_to_list = list(dim_gradeCategory.itertuples(index=False, name=None))
query_insert_dim_gradeCategory = """   INSERT INTO dim_gradecategory (idgradeCategory, mingrade, maxgrade, category) VALUES (:1, :2, :3, :4)"""
write(dim_gradeCategory_to_list, query_insert_dim_gradeCategory)

ORA-00001: unique constraint (ODIDATA.DIM_GRADECATEGORY_PK) violated

# Dim_Tyear

In [42]:
reservation_oltp = read('reservation')
reservation_oltp

    id_res  total_price start_date   end_date  apartment_id_app  guest_id_u
0        6         9000 2023-09-26 2023-09-28                 1           1
1        7         5000 2023-06-05 2023-06-08                 2           1
2        8         3000 2023-08-10 2023-08-14                 2           1
3        9         2500 2022-10-01 2022-10-06                 2           1
4       10         7000 2021-07-22 2021-07-28                 2           1
5       11         6500 2019-04-16 2019-04-19                 2           1
6       12         4200 2019-04-11 2019-04-15                 3           1
7       13         6700 2019-10-22 2019-10-24                 3           1
8       14         3200 2020-08-06 2020-08-09                 3           1
9       15         9500 2022-09-28 2022-09-30                 3           1
10      16        11400 2023-06-05 2023-06-06                 3           1
11      17         5500 2021-02-05 2021-02-17                 4           1
12      18         6900 2021-07-15 2021-07-18                 4           1
13      19        11000 2019-05-11 2019-05-15                 4           1
14      20         7000 2023-10-22 2023-10-24                 4           1
15      21         4000 2022-01-23 2022-01-25                 4           1
16       1         3000 2022-01-01 2022-01-02                 1           1
17       2        12000 2021-02-02 2021-02-05                 1           1
18       3         7000 2022-03-03 2022-03-05                 1           1
19       4         5000 2023-01-05 2023-01-08                 1           1
20       5         9000 2023-01-26 2023-01-28                 1           1

In [52]:
# for index, row in data.iterrows():
#     if pd.isna(data.at[index, 'Price_DOLLAR']):
#         data.at[index, 'Price_RSD'] = data.at[index, 'Price_EUR']*117.2
#     elif pd.isna(data.at[index, 'Price_EUR']):
#         data.at[index, 'Price_RSD'] = data.at[index, 'Price_DOLLAR']*108.32

In [43]:
tyear_data = data

In [44]:
reservation_oltp['start_date'] = pd.to_datetime(reservation_oltp['start_date'])

# Create a new column 'year' to extract the year from the 'date' column
reservation_oltp['year'] = reservation_oltp['start_date'].dt.year

# Group by 'year' and sum the 'price' column
result_oltp = reservation_oltp.groupby('year')['total_price'].sum().reset_index()
result_oltp

   year  total_price
0  2019        28400
1  2020         3200
2  2021        31400
3  2022        26000
4  2023        49400

In [45]:
new_column_names = {'total_price': 'Price_RSD'}
result_oltp = result_oltp.rename(columns=new_column_names)
result_oltp

   year  Price_RSD
0  2019      28400
1  2020       3200
2  2021      31400
3  2022      26000
4  2023      49400

In [46]:
tyear_data['Start Date'] = pd.to_datetime(tyear_data['Start Date'], format='%d.%m.%Y')

tyear_data['year'] = tyear_data['Start Date'].dt.year

result_data = tyear_data.groupby('year')['Price_RSD'].sum().reset_index()
result_data

   year   Price_RSD
0  2019  3531291.33
1  2020   595858.92
2  2021  1243456.46
3  2022  2235116.36
4  2023  4437666.53

In [47]:
merged_price_df = pd.concat([result_oltp, result_data])

merged_price_df = merged_price_df.groupby('year')['Price_RSD'].sum().reset_index()
merged_price_df

   year   Price_RSD
0  2019  3559691.33
1  2020   599058.92
2  2021  1274856.46
3  2022  2261116.36
4  2023  4487066.53

In [48]:
new_column_names = {'Price_RSD':'profit'}
merged_price_df = merged_price_df.rename(columns=new_column_names)
merged_price_df

   year      profit
0  2019  3559691.33
1  2020   599058.92
2  2021  1274856.46
3  2022  2261116.36
4  2023  4487066.53

In [49]:
merged_price_df['idtime_year'] = range(1, len(merged_price_df) + 1)
merged_price_df

   year      profit  idtime_year
0  2019  3559691.33            1
1  2020   599058.92            2
2  2021  1274856.46            3
3  2022  2261116.36            4
4  2023  4487066.53            5

In [50]:
new_column_order = ['idtime_year', 'year', 'profit']
merged_price_df = merged_price_df[new_column_order]
merged_price_df

   idtime_year  year      profit
0            1  2019  3559691.33
1            2  2020   599058.92
2            3  2021  1274856.46
3            4  2022  2261116.36
4            5  2023  4487066.53

In [61]:
dim_tyear_to_list = list(merged_price_df.itertuples(index=False, name=None))
query_insert_dim_tyear = """   INSERT INTO dim_tyear (idtime_year, year, profit) VALUES (:1, :2, :3)"""
write(dim_tyear_to_list, query_insert_dim_tyear)

ORA-00001: unique constraint (ODIDATA.DIM_TYEAR_PK) violated

# Dim_TQuarter

In [51]:
reservation_oltp['start_date'] = pd.to_datetime(reservation_oltp['start_date'])

reservation_oltp['month'] = reservation_oltp['start_date'].dt.to_period('M')

In [52]:
reservation_oltp['month'] = reservation_oltp['month'].astype(str)

# Extract year and month separately
reservation_oltp['year'] = reservation_oltp['month'].str[:4]
reservation_oltp['month'] = reservation_oltp['month'].str[5:]

# Map months to quarters
quarter_mapping = {'01': '1', '02': '1', '03': '1',
                   '04': '2', '05': '2', '06': '2',
                   '07': '3', '08': '3', '09': '3',
                   '10': '4', '11': '4', '12': '4'}

reservation_oltp['quarter'] = reservation_oltp['month'].map(quarter_mapping)

# Group by year and quarter, then sum the total_price
result_quarters_oltp = reservation_oltp.groupby(['year', 'quarter'])['total_price'].sum().reset_index()

# Display the updated result
print(result_quarters_oltp)

    year quarter  total_price
0   2019       2        21700
1   2019       4         6700
2   2020       3         3200
3   2021       1        17500
4   2021       3        13900
5   2022       1        14000
6   2022       3         9500
7   2022       4         2500
8   2023       1        14000
9   2023       2        16400
10  2023       3        12000
11  2023       4         7000

In [53]:
tquarter_data = data
data['Start Date']

0     2019-04-03
1     2019-04-06
2     2019-04-07
3     2019-04-10
4     2019-04-11
         ...
700   2023-07-16
701   2023-07-14
702   2023-05-26
703   2023-09-24
704   2023-09-27
Name: Start Date, Length: 705, dtype: datetime64[ns]

In [54]:
tquarter_data['Start Date'] = pd.to_datetime(tquarter_data['Start Date'])

tquarter_data['year'] = tquarter_data['Start Date'].dt.year
tquarter_data['month'] = tquarter_data['Start Date'].dt.month

# Map months to quarters
quarter_mapping = {1: '1', 2: '1', 3: '1',
                   4: '2', 5: '2', 6: '2',
                   7: '3', 8: '3', 9: '3',
                   10: '4', 11: '4', 12: '4'}

tquarter_data['quarter'] = tquarter_data['month'].map(quarter_mapping)

result_quarters_data = tquarter_data.groupby(['year', 'quarter'])['Price_RSD'].sum().reset_index()

print(result_quarters_data)

    year quarter   Price_RSD
0   2019       2  1202236.58
1   2019       3  2081561.08
2   2019       4   247493.67
3   2020       2    13771.73
4   2020       3   582087.19
5   2021       2   103483.77
6   2021       3  1139972.69
7   2022       2   614931.10
8   2022       3  1539714.40
9   2022       4    80470.86
10  2023       2  1391759.57
11  2023       3  2884314.79
12  2023       4   161592.17

In [55]:
print(result_quarters_oltp)
print(result_quarters_data)

    year quarter  total_price
0   2019       2        21700
1   2019       4         6700
2   2020       3         3200
3   2021       1        17500
4   2021       3        13900
5   2022       1        14000
6   2022       3         9500
7   2022       4         2500
8   2023       1        14000
9   2023       2        16400
10  2023       3        12000
11  2023       4         7000
    year quarter   Price_RSD
0   2019       2  1202236.58
1   2019       3  2081561.08
2   2019       4   247493.67
3   2020       2    13771.73
4   2020       3   582087.19
5   2021       2   103483.77
6   2021       3  1139972.69
7   2022       2   614931.10
8   2022       3  1539714.40
9   2022       4    80470.86
10  2023       2  1391759.57
11  2023       3  2884314.79
12  2023       4   161592.17

In [56]:
result_quarters_oltp['year'] = result_quarters_oltp['year'].astype(int)
result_quarters_data['year'] = result_quarters_data['year'].astype(int)

merged_price_quarter = pd.merge(result_quarters_oltp, result_quarters_data, on=['year', 'quarter'], suffixes=('_oltp', '_data'), how='outer')

merged_price_quarter['Total_Price'] = merged_price_quarter['total_price'] + merged_price_quarter['Price_RSD']

for index, row in merged_price_quarter.iterrows():
    if pd.isna(merged_price_quarter.at[index, 'total_price']):
        merged_price_quarter.at[index, 'Total_Price'] = merged_price_quarter.at[index, 'Price_RSD']
    elif pd.isna(merged_price_quarter.at[index, 'Price_RSD']):
        merged_price_quarter.at[index, 'Total_Price'] = merged_price_quarter.at[index, 'total_price']
        
merged_price_quarter

    year quarter  total_price   Price_RSD  Total_Price
0   2019       2      21700.0  1202236.58   1223936.58
1   2019       3          NaN  2081561.08   2081561.08
2   2019       4       6700.0   247493.67    254193.67
3   2020       2          NaN    13771.73     13771.73
4   2020       3       3200.0   582087.19    585287.19
5   2021       1      17500.0         NaN     17500.00
6   2021       2          NaN   103483.77    103483.77
7   2021       3      13900.0  1139972.69   1153872.69
8   2022       1      14000.0         NaN     14000.00
9   2022       2          NaN   614931.10    614931.10
10  2022       3       9500.0  1539714.40   1549214.40
11  2022       4       2500.0    80470.86     82970.86
12  2023       1      14000.0         NaN     14000.00
13  2023       2      16400.0  1391759.57   1408159.57
14  2023       3      12000.0  2884314.79   2896314.79
15  2023       4       7000.0   161592.17    168592.17

In [57]:
columns_to_drop = ['total_price', 'Price_RSD']
merged_price_quarter = merged_price_quarter.drop(columns=columns_to_drop)
merged_price_quarter

    year quarter  Total_Price
0   2019       2   1223936.58
1   2019       3   2081561.08
2   2019       4    254193.67
3   2020       2     13771.73
4   2020       3    585287.19
5   2021       1     17500.00
6   2021       2    103483.77
7   2021       3   1153872.69
8   2022       1     14000.00
9   2022       2    614931.10
10  2022       3   1549214.40
11  2022       4     82970.86
12  2023       1     14000.00
13  2023       2   1408159.57
14  2023       3   2896314.79
15  2023       4    168592.17

In [58]:
merged_price_quarter['quarter'] = merged_price_quarter['quarter'].astype(int)

merged_price_quarter['start'] = merged_price_quarter['quarter'].apply(lambda x: 1 if x == 1 else (x - 1) * 3 + 1)
merged_price_quarter['end'] = merged_price_quarter['quarter'] * 3
merged_price_quarter

    year  quarter  Total_Price  start  end
0   2019        2   1223936.58      4    6
1   2019        3   2081561.08      7    9
2   2019        4    254193.67     10   12
3   2020        2     13771.73      4    6
4   2020        3    585287.19      7    9
5   2021        1     17500.00      1    3
6   2021        2    103483.77      4    6
7   2021        3   1153872.69      7    9
8   2022        1     14000.00      1    3
9   2022        2    614931.10      4    6
10  2022        3   1549214.40      7    9
11  2022        4     82970.86     10   12
12  2023        1     14000.00      1    3
13  2023        2   1408159.57      4    6
14  2023        3   2896314.79      7    9
15  2023        4    168592.17     10   12

In [59]:
numeric_to_month = {1: 'January', 2: 'February', 3: 'March', 4: 'April',
                    5: 'May', 6: 'June', 7: 'July', 8: 'August',
                    9: 'September', 10: 'October', 11: 'November', 12: 'December'}

merged_price_quarter['start'] = merged_price_quarter['start'].replace(numeric_to_month)
merged_price_quarter['end'] = merged_price_quarter['end'].replace(numeric_to_month)
merged_price_quarter

    year  quarter  Total_Price    start        end
0   2019        2   1223936.58    April       June
1   2019        3   2081561.08     July  September
2   2019        4    254193.67  October   December
3   2020        2     13771.73    April       June
4   2020        3    585287.19     July  September
5   2021        1     17500.00  January      March
6   2021        2    103483.77    April       June
7   2021        3   1153872.69     July  September
8   2022        1     14000.00  January      March
9   2022        2    614931.10    April       June
10  2022        3   1549214.40     July  September
11  2022        4     82970.86  October   December
12  2023        1     14000.00  January      March
13  2023        2   1408159.57    April       June
14  2023        3   2896314.79     July  September
15  2023        4    168592.17  October   December

In [60]:
numeric_to_year = {2019 : 1, 2020 : 2, 2021 : 3, 2022 : 4, 2023 : 5}

merged_price_quarter['year'] = merged_price_quarter['year'].replace(numeric_to_year)
merged_price_quarter

    year  quarter  Total_Price    start        end
0      1        2   1223936.58    April       June
1      1        3   2081561.08     July  September
2      1        4    254193.67  October   December
3      2        2     13771.73    April       June
4      2        3    585287.19     July  September
5      3        1     17500.00  January      March
6      3        2    103483.77    April       June
7      3        3   1153872.69     July  September
8      4        1     14000.00  January      March
9      4        2    614931.10    April       June
10     4        3   1549214.40     July  September
11     4        4     82970.86  October   December
12     5        1     14000.00  January      March
13     5        2   1408159.57    April       June
14     5        3   2896314.79     July  September
15     5        4    168592.17  October   December

In [61]:
merged_price_quarter['id_tquarter'] = range(1, len(merged_price_quarter) + 1)
merged_price_quarter

    year  quarter  Total_Price    start        end  id_tquarter
0      1        2   1223936.58    April       June            1
1      1        3   2081561.08     July  September            2
2      1        4    254193.67  October   December            3
3      2        2     13771.73    April       June            4
4      2        3    585287.19     July  September            5
5      3        1     17500.00  January      March            6
6      3        2    103483.77    April       June            7
7      3        3   1153872.69     July  September            8
8      4        1     14000.00  January      March            9
9      4        2    614931.10    April       June           10
10     4        3   1549214.40     July  September           11
11     4        4     82970.86  October   December           12
12     5        1     14000.00  January      March           13
13     5        2   1408159.57    April       June           14
14     5        3   2896314.79     July  September           15
15     5        4    168592.17  October   December           16

In [62]:
new_column_names = {'year' : 'dim_tyear_idtime_year', 'start' : 'start_date', 'end' : 'end_date', 'Total_Price':'profit'}
result_quarters_df = merged_price_quarter.rename(columns=new_column_names)
result_quarters_df

,dim_tyear_idtime_year,quarter,profit,start_date,end_date,id_tquarter
0,1,2,1223936.58,April,June,1
1,1,3,2081561.08,July,September,2
2,1,4,254193.67,October,December,3
3,2,2,13771.73,April,June,4
4,2,3,585287.19,July,September,5
5,3,1,17500.00,January,March,6
6,3,2,103483.77,April,June,7
7,3,3,1153872.69,July,September,8
8,4,1,14000.00,January,March,9
9,4,2,614931.10,April,June,10
10,4,3,1549214.40,July,September,11
11,4,4,82970.86,October,December,12
12,5,1,14000.00,January,March,13
13,5,2,1408159.57,April,June,14
14,5,3,2896314.79,July,September,15
15,5,4,168592.17,October,December,16

In [63]:
new_column_order = ['id_tquarter', 'quarter', 'dim_tyear_idtime_year', 'start_date', 'end_date', 'profit']
result_quarters_df = result_quarters_df[new_column_order]
result_quarters_df

,id_tquarter,quarter,dim_tyear_idtime_year,start_date,end_date,profit
0,1,2,1,April,June,1223936.58
1,2,3,1,July,September,2081561.08
2,3,4,1,October,December,254193.67
3,4,2,2,April,June,13771.73
4,5,3,2,July,September,585287.19
5,6,1,3,January,March,17500.00
6,7,2,3,April,June,103483.77
7,8,3,3,July,September,1153872.69
8,9,1,4,January,March,14000.00
9,10,2,4,April,June,614931.10
10,11,3,4,July,September,1549214.40
11,12,4,4,October,December,82970.86
12,13,1,5,January,March,14000.00
13,14,2,5,April,June,1408159.57
14,15,3,5,July,September,2896314.79
15,16,4,5,October,December,168592.17

In [75]:
dim_tquarter_to_list = list(result_quarters_df.itertuples(index=False, name=None))
query_insert_dim_tquarter = """ INSERT INTO dim_tquarter (id_tquarter, quarter, dim_tyear_idtime_year, startdate, enddate, profit) 
                                VALUES (:1, :2, :3, :4, :5, :6)"""
write(dim_tquarter_to_list, query_insert_dim_tquarter)

ORA-00001: unique constraint (ODIDATA.DIM_TQUARTER_PK) violated

# Dim_Tmonth

In [64]:
reservation_oltp_month = read('reservation')
reservation_oltp_month['start_date'] = pd.to_datetime(reservation_oltp_month['start_date'])
reservation_oltp_month['month'] = reservation_oltp_month['start_date'].dt.to_period('M')
reservation_oltp_month

columns_to_drop = ['id_res', 'start_date', 'end_date', 'apartment_id_app', 'guest_id_u']
reservation_oltp_month = reservation_oltp_month.drop(columns=columns_to_drop)
reservation_oltp_month

    total_price    month
0          9000  2023-09
1          5000  2023-06
2          3000  2023-08
3          2500  2022-10
4          7000  2021-07
5          6500  2019-04
6          4200  2019-04
7          6700  2019-10
8          3200  2020-08
9          9500  2022-09
10        11400  2023-06
11         5500  2021-02
12         6900  2021-07
13        11000  2019-05
14         7000  2023-10
15         4000  2022-01
16         3000  2022-01
17        12000  2021-02
18         7000  2022-03
19         5000  2023-01
20         9000  2023-01

In [65]:
new_column_names = {'total_price' : 'Price_RSD'}
result_oltp_month = reservation_oltp_month.rename(columns=new_column_names)
result_oltp_month

    Price_RSD    month
0        9000  2023-09
1        5000  2023-06
2        3000  2023-08
3        2500  2022-10
4        7000  2021-07
5        6500  2019-04
6        4200  2019-04
7        6700  2019-10
8        3200  2020-08
9        9500  2022-09
10      11400  2023-06
11       5500  2021-02
12       6900  2021-07
13      11000  2019-05
14       7000  2023-10
15       4000  2022-01
16       3000  2022-01
17      12000  2021-02
18       7000  2022-03
19       5000  2023-01
20       9000  2023-01

In [66]:
data_month = data
data_month

,Id,Book Number,Booked By,Guest Name,Start Date,End Date,Booked On,Status,Rooms,Number Of People,...,Cleanliness,Comfort,Value For Money,Location,Free WiFi,Accommodation Type,Number Of Nights,year,month,quarter
0,0,2245705225.0,Veeravalli Gopi,Gopi Veeravalli,2019-04-03,06.04.2019,30.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,NaN,2019,4,2
1,1,2071623069.0,Kretov Nikita,Nikita Kretov,2019-04-06,11.04.2019,01.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,NaN,2019,4,2
2,2,3037388122.0,Yuheng Huang,Yuheng Huang,2019-04-07,08.04.2019,31.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,NaN,2019,4,2
3,3,3181654986.0,Li Fengju,Fengju Li,2019-04-10,11.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,D,NaN,2019,4,2
4,4,3642008503.0,Li Fengju,NaN,2019-04-11,12.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,NaN,2019,4,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
700,700,HMH8EJZ8P3,NaN,Ed Austwick,2023-07-16,21.07.2023,08.01.2023,Confirmed,NaN,2,...,NaN,NaN,NaN,NaN,NaN,D,5.0,2023,7,3
701,701,HMN42DNAYH,NaN,Line Viktoria Fineide,2023-07-14,17.07.2023,28.06.2023,Confirmed,NaN,2,...,NaN,NaN,NaN,NaN,NaN,A,3.0,2023,7,3
702,709,HM4CDA5HQZ,NaN,Lenny,2023-05-26,28.05.2023,24.03.2023,Cancelled,NaN,2,...,NaN,NaN,NaN,NaN,NaN,C,2.0,2023,5,2
703,711,HMK9549AFB,NaN,Aldeen Ahamed,2023-09-24,26.09.2023,NaN,Confirmed,NaN,2,...,NaN,NaN,NaN,NaN,NaN,C,2.0,2023,9,3
704,712,HMWP3DRS4Y,NaN,Donald Houle,2023-09-27,29.09.2023,NaN,Confirmed,NaN,2,...,NaN,NaN,NaN,NaN,NaN,C,2.0,2023,9,3

In [67]:
data_month['Start Date'] = pd.to_datetime(data_month['Start Date'])

data_month['month'] = data_month['Start Date'].dt.to_period('M')

result_month_data = data_month.groupby('month')['Price_RSD'].sum().reset_index()
result_month_data

      month   Price_RSD
0   2019-04   240802.16
1   2019-05   392108.57
2   2019-06   569325.85
3   2019-07   726491.90
4   2019-08   736090.39
5   2019-09   618978.79
6   2019-10   247493.67
7   2020-06    13771.73
8   2020-07   114532.23
9   2020-08   340626.51
10  2020-09   126928.45
11  2021-06   103483.77
12  2021-07   567118.08
13  2021-08   490184.02
14  2021-09    82670.59
15  2022-05    99235.59
16  2022-06   515695.51
17  2022-07   663455.67
18  2022-08   406735.50
19  2022-09   469523.23
20  2022-10    80470.86
21  2023-04   250895.64
22  2023-05   451333.46
23  2023-06   689530.47
24  2023-07   971796.46
25  2023-08  1072928.79
26  2023-09   839589.54
27  2023-10   161592.17

In [68]:
merged_price_month = pd.merge(result_oltp_month, result_month_data, on=['month'], suffixes=('_oltp', '_data'), how='outer')

merged_price_month['Total_Price'] = merged_price_month['Price_RSD_oltp'] + merged_price_month['Price_RSD_data']

for index, row in merged_price_month.iterrows():
    if pd.isna(merged_price_month.at[index, 'Price_RSD_oltp']):
        merged_price_month.at[index, 'Total_Price'] = merged_price_month.at[index, 'Price_RSD_data']
    elif pd.isna(merged_price_month.at[index, 'Price_RSD_data']):
        merged_price_month.at[index, 'Total_Price'] = merged_price_month.at[index, 'Price_RSD_oltp']
        
merged_price_month

    Price_RSD_oltp    month  Price_RSD_data  Total_Price
0           6500.0  2019-04       240802.16    247302.16
1           4200.0  2019-04       240802.16    245002.16
2          11000.0  2019-05       392108.57    403108.57
3              NaN  2019-06       569325.85    569325.85
4              NaN  2019-07       726491.90    726491.90
5              NaN  2019-08       736090.39    736090.39
6              NaN  2019-09       618978.79    618978.79
7           6700.0  2019-10       247493.67    254193.67
8              NaN  2020-06        13771.73     13771.73
9              NaN  2020-07       114532.23    114532.23
10          3200.0  2020-08       340626.51    343826.51
11             NaN  2020-09       126928.45    126928.45
12          5500.0  2021-02             NaN      5500.00
13         12000.0  2021-02             NaN     12000.00
14             NaN  2021-06       103483.77    103483.77
15          7000.0  2021-07       567118.08    574118.08
16          6900.0  2021-07       567118.08    574018.08
17             NaN  2021-08       490184.02    490184.02
18             NaN  2021-09        82670.59     82670.59
19          4000.0  2022-01             NaN      4000.00
20          3000.0  2022-01             NaN      3000.00
21          7000.0  2022-03             NaN      7000.00
22             NaN  2022-05        99235.59     99235.59
23             NaN  2022-06       515695.51    515695.51
24             NaN  2022-07       663455.67    663455.67
25             NaN  2022-08       406735.50    406735.50
26          9500.0  2022-09       469523.23    479023.23
27          2500.0  2022-10        80470.86     82970.86
28          5000.0  2023-01             NaN      5000.00
29          9000.0  2023-01             NaN      9000.00
30             NaN  2023-04       250895.64    250895.64
31             NaN  2023-05       451333.46    451333.46
32          5000.0  2023-06       689530.47    694530.47
33         11400.0  2023-06       689530.47    700930.47
34             NaN  2023-07       971796.46    971796.46
35          3000.0  2023-08      1072928.79   1075928.79
36          9000.0  2023-09       839589.54    848589.54
37          7000.0  2023-10       161592.17    168592.17

In [69]:
columns_to_drop = ['Price_RSD_oltp', 'Price_RSD_data']
merged_price_month = merged_price_month.drop(columns=columns_to_drop)
merged_price_month

      month  Total_Price
0   2019-04    247302.16
1   2019-04    245002.16
2   2019-05    403108.57
3   2019-06    569325.85
4   2019-07    726491.90
5   2019-08    736090.39
6   2019-09    618978.79
7   2019-10    254193.67
8   2020-06     13771.73
9   2020-07    114532.23
10  2020-08    343826.51
11  2020-09    126928.45
12  2021-02      5500.00
13  2021-02     12000.00
14  2021-06    103483.77
15  2021-07    574118.08
16  2021-07    574018.08
17  2021-08    490184.02
18  2021-09     82670.59
19  2022-01      4000.00
20  2022-01      3000.00
21  2022-03      7000.00
22  2022-05     99235.59
23  2022-06    515695.51
24  2022-07    663455.67
25  2022-08    406735.50
26  2022-09    479023.23
27  2022-10     82970.86
28  2023-01      5000.00
29  2023-01      9000.00
30  2023-04    250895.64
31  2023-05    451333.46
32  2023-06    694530.47
33  2023-06    700930.47
34  2023-07    971796.46
35  2023-08   1075928.79
36  2023-09    848589.54
37  2023-10    168592.17

In [70]:
numeric_to_year = {'2019' : 1, '2020' : 2, '2021' : 3, '2022' : 4, '2023' : 5}

merged_price_month['dim_tyear_idtime_year'] = merged_price_month['month'].astype(str).str[:4]
merged_price_month['dim_tyear_idtime_year'] = merged_price_month['dim_tyear_idtime_year'].map(numeric_to_year)

quarter_mapping = {'01': 1, '02': 1, '03': 1,
                   '04': 2, '05': 2, '06': 2,
                   '07': 3, '08': 3, '09': 3,
                   '10': 4, '11': 4, '12': 4}

merged_price_month['quarter'] = merged_price_month['month'].astype(str).str[5:]
merged_price_month['quarter'] = merged_price_month['quarter'].map(quarter_mapping)

merged_price_month

      month  Total_Price  dim_tyear_idtime_year  quarter
0   2019-04    247302.16                      1        2
1   2019-04    245002.16                      1        2
2   2019-05    403108.57                      1        2
3   2019-06    569325.85                      1        2
4   2019-07    726491.90                      1        3
5   2019-08    736090.39                      1        3
6   2019-09    618978.79                      1        3
7   2019-10    254193.67                      1        4
8   2020-06     13771.73                      2        2
9   2020-07    114532.23                      2        3
10  2020-08    343826.51                      2        3
11  2020-09    126928.45                      2        3
12  2021-02      5500.00                      3        1
13  2021-02     12000.00                      3        1
14  2021-06    103483.77                      3        2
15  2021-07    574118.08                      3        3
16  2021-07    574018.08                      3        3
17  2021-08    490184.02                      3        3
18  2021-09     82670.59                      3        3
19  2022-01      4000.00                      4        1
20  2022-01      3000.00                      4        1
21  2022-03      7000.00                      4        1
22  2022-05     99235.59                      4        2
23  2022-06    515695.51                      4        2
24  2022-07    663455.67                      4        3
25  2022-08    406735.50                      4        3
26  2022-09    479023.23                      4        3
27  2022-10     82970.86                      4        4
28  2023-01      5000.00                      5        1
29  2023-01      9000.00                      5        1
30  2023-04    250895.64                      5        2
31  2023-05    451333.46                      5        2
32  2023-06    694530.47                      5        2
33  2023-06    700930.47                      5        2
34  2023-07    971796.46                      5        3
35  2023-08   1075928.79                      5        3
36  2023-09    848589.54                      5        3
37  2023-10    168592.17                      5        4

In [71]:
quarterTable = read('dim_tquarter')
quarterTable

    id_tquarter  quarter startdate    enddate   profit  dim_tyear_idtime_year
0             1        2     April       June  1202237                      1
1             2        3      July  September  2081561                      1
2             3        4   October   December   247494                      1
3             4        2     April       June    13772                      2
4             5        3      July  September   582087                      2
5             6        1   January      March    12000                      3
6             7        2     April       June   103484                      3
7             8        3      July  September  1139973                      3
8             9        1   January      March    10000                      4
9            10        2     April       June   614931                      4
10           11        3      July  September  1539714                      4
11           12        4   October   December    80471                      4
12           13        1   January      March    14000                      5
13           14        2     April       June  1391760                      5
14           15        3      July  September  2884315                      5
15           16        4   October   December   170592                      5

In [72]:
merged_price_month.head()

     month  Total_Price  dim_tyear_idtime_year  quarter
0  2019-04    247302.16                      1        2
1  2019-04    245002.16                      1        2
2  2019-05    403108.57                      1        2
3  2019-06    569325.85                      1        2
4  2019-07    726491.90                      1        3

In [73]:
quarterTable.head()

   id_tquarter  quarter startdate    enddate   profit  dim_tyear_idtime_year
0            1        2     April       June  1202237                      1
1            2        3      July  September  2081561                      1
2            3        4   October   December   247494                      1
3            4        2     April       June    13772                      2
4            5        3      July  September   582087                      2

In [74]:
merged_price_month['dim_tquarter_id_tquarter'] = np.nan
for index, row in merged_price_month.iterrows():
    for index2, row2 in quarterTable.iterrows():
            if row['dim_tyear_idtime_year'] == row2['dim_tyear_idtime_year']:
                if row['quarter'] == row2['quarter']: 
                    merged_price_month.at[index,'dim_tquarter_id_tquarter'] = quarterTable.at[index2,'id_tquarter']

merged_price_month

,month,Total_Price,dim_tyear_idtime_year,quarter,dim_tquarter_id_tquarter
0,2019-04,247302.16,1,2,1.0
1,2019-04,245002.16,1,2,1.0
2,2019-05,403108.57,1,2,1.0
3,2019-06,569325.85,1,2,1.0
4,2019-07,726491.90,1,3,2.0
5,2019-08,736090.39,1,3,2.0
6,2019-09,618978.79,1,3,2.0
7,2019-10,254193.67,1,4,3.0
8,2020-06,13771.73,2,2,4.0
9,2020-07,114532.23,2,3,5.0
10,2020-08,343826.51,2,3,5.0
11,2020-09,126928.45,2,3,5.0
12,2021-02,5500.00,3,1,6.0
13,2021-02,12000.00,3,1,6.0
14,2021-06,103483.77,3,2,7.0
15,2021-07,574118.08,3,3,8.0
16,2021-07,574018.08,3,3,8.0
17,2021-08,490184.02,3,3,8.0
18,2021-09,82670.59,3,3,8.0
19,2022-01,4000.00,4,1,9.0
20,2022-01,3000.00,4,1,9.0
21,2022-03,7000.00,4,1,9.0
22,2022-05,99235.59,4,2,10.0
23,2022-06,515695.51,4,2,10.0
24,2022-07,663455.67,4,3,11.0
25,2022-08,406735.50,4,3,11.0
26,2022-09,479023.23,4,3,11.0
27,2022-10,82970.86,4,4,12.0
28,2023-01,5000.00,5,1,13.0
29,2023-01,9000.00,5,1,13.0
30,2023-04,250895.64,5,2,14.0
31,2023-05,451333.46,5,2,14.0
32,2023-06,694530.47,5,2,14.0
33,2023-06,700930.47,5,2,14.0
34,2023-07,971796.46,5,3,15.0
35,2023-08,1075928.79,5,3,15.0
36,2023-09,848589.54,5,3,15.0
37,2023-10,168592.17,5,4,16.0

In [75]:
columns_to_drop = ['dim_tyear_idtime_year', 'quarter']
merged_price_month = merged_price_month.drop(columns=columns_to_drop)
merged_price_month

      month  Total_Price  dim_tquarter_id_tquarter
0   2019-04    247302.16                       1.0
1   2019-04    245002.16                       1.0
2   2019-05    403108.57                       1.0
3   2019-06    569325.85                       1.0
4   2019-07    726491.90                       2.0
5   2019-08    736090.39                       2.0
6   2019-09    618978.79                       2.0
7   2019-10    254193.67                       3.0
8   2020-06     13771.73                       4.0
9   2020-07    114532.23                       5.0
10  2020-08    343826.51                       5.0
11  2020-09    126928.45                       5.0
12  2021-02      5500.00                       6.0
13  2021-02     12000.00                       6.0
14  2021-06    103483.77                       7.0
15  2021-07    574118.08                       8.0
16  2021-07    574018.08                       8.0
17  2021-08    490184.02                       8.0
18  2021-09     82670.59                       8.0
19  2022-01      4000.00                       9.0
20  2022-01      3000.00                       9.0
21  2022-03      7000.00                       9.0
22  2022-05     99235.59                      10.0
23  2022-06    515695.51                      10.0
24  2022-07    663455.67                      11.0
25  2022-08    406735.50                      11.0
26  2022-09    479023.23                      11.0
27  2022-10     82970.86                      12.0
28  2023-01      5000.00                      13.0
29  2023-01      9000.00                      13.0
30  2023-04    250895.64                      14.0
31  2023-05    451333.46                      14.0
32  2023-06    694530.47                      14.0
33  2023-06    700930.47                      14.0
34  2023-07    971796.46                      15.0
35  2023-08   1075928.79                      15.0
36  2023-09    848589.54                      15.0
37  2023-10    168592.17                      16.0

In [76]:
merged_price_month['month'] = merged_price_month['month'].astype(str).str[5:]
merged_price_month

   month  Total_Price  dim_tquarter_id_tquarter
0     04    247302.16                       1.0
1     04    245002.16                       1.0
2     05    403108.57                       1.0
3     06    569325.85                       1.0
4     07    726491.90                       2.0
5     08    736090.39                       2.0
6     09    618978.79                       2.0
7     10    254193.67                       3.0
8     06     13771.73                       4.0
9     07    114532.23                       5.0
10    08    343826.51                       5.0
11    09    126928.45                       5.0
12    02      5500.00                       6.0
13    02     12000.00                       6.0
14    06    103483.77                       7.0
15    07    574118.08                       8.0
16    07    574018.08                       8.0
17    08    490184.02                       8.0
18    09     82670.59                       8.0
19    01      4000.00                       9.0
20    01      3000.00                       9.0
21    03      7000.00                       9.0
22    05     99235.59                      10.0
23    06    515695.51                      10.0
24    07    663455.67                      11.0
25    08    406735.50                      11.0
26    09    479023.23                      11.0
27    10     82970.86                      12.0
28    01      5000.00                      13.0
29    01      9000.00                      13.0
30    04    250895.64                      14.0
31    05    451333.46                      14.0
32    06    694530.47                      14.0
33    06    700930.47                      14.0
34    07    971796.46                      15.0
35    08   1075928.79                      15.0
36    09    848589.54                      15.0
37    10    168592.17                      16.0

In [77]:
numeric_to_month = {'01': 'January', '02': 'February', '03': 'March', '04': 'April',
                    '05': 'May', '06': 'June', '07': 'July', '08': 'August',
                    '09': 'September', '10': 'October', '11': 'November', '12': 'December'}

merged_price_month['month'] = merged_price_month['month'].replace(numeric_to_month)
merged_price_month

        month  Total_Price  dim_tquarter_id_tquarter
0       April    247302.16                       1.0
1       April    245002.16                       1.0
2         May    403108.57                       1.0
3        June    569325.85                       1.0
4        July    726491.90                       2.0
5      August    736090.39                       2.0
6   September    618978.79                       2.0
7     October    254193.67                       3.0
8        June     13771.73                       4.0
9        July    114532.23                       5.0
10     August    343826.51                       5.0
11  September    126928.45                       5.0
12   February      5500.00                       6.0
13   February     12000.00                       6.0
14       June    103483.77                       7.0
15       July    574118.08                       8.0
16       July    574018.08                       8.0
17     August    490184.02                       8.0
18  September     82670.59                       8.0
19    January      4000.00                       9.0
20    January      3000.00                       9.0
21      March      7000.00                       9.0
22        May     99235.59                      10.0
23       June    515695.51                      10.0
24       July    663455.67                      11.0
25     August    406735.50                      11.0
26  September    479023.23                      11.0
27    October     82970.86                      12.0
28    January      5000.00                      13.0
29    January      9000.00                      13.0
30      April    250895.64                      14.0
31        May    451333.46                      14.0
32       June    694530.47                      14.0
33       June    700930.47                      14.0
34       July    971796.46                      15.0
35     August   1075928.79                      15.0
36  September    848589.54                      15.0
37    October    168592.17                      16.0

In [78]:
merged_price_month['id_tmonth'] = range(1, len(merged_price_month) + 1)
merged_price_month

        month  Total_Price  dim_tquarter_id_tquarter  id_tmonth
0       April    247302.16                       1.0          1
1       April    245002.16                       1.0          2
2         May    403108.57                       1.0          3
3        June    569325.85                       1.0          4
4        July    726491.90                       2.0          5
5      August    736090.39                       2.0          6
6   September    618978.79                       2.0          7
7     October    254193.67                       3.0          8
8        June     13771.73                       4.0          9
9        July    114532.23                       5.0         10
10     August    343826.51                       5.0         11
11  September    126928.45                       5.0         12
12   February      5500.00                       6.0         13
13   February     12000.00                       6.0         14
14       June    103483.77                       7.0         15
15       July    574118.08                       8.0         16
16       July    574018.08                       8.0         17
17     August    490184.02                       8.0         18
18  September     82670.59                       8.0         19
19    January      4000.00                       9.0         20
20    January      3000.00                       9.0         21
21      March      7000.00                       9.0         22
22        May     99235.59                      10.0         23
23       June    515695.51                      10.0         24
24       July    663455.67                      11.0         25
25     August    406735.50                      11.0         26
26  September    479023.23                      11.0         27
27    October     82970.86                      12.0         28
28    January      5000.00                      13.0         29
29    January      9000.00                      13.0         30
30      April    250895.64                      14.0         31
31        May    451333.46                      14.0         32
32       June    694530.47                      14.0         33
33       June    700930.47                      14.0         34
34       July    971796.46                      15.0         35
35     August   1075928.79                      15.0         36
36  September    848589.54                      15.0         37
37    October    168592.17                      16.0         38

In [79]:
new_column_names = {'Total_Price' : 'profit'}
merged_price_month = merged_price_month.rename(columns=new_column_names)
merged_price_month

        month      profit  dim_tquarter_id_tquarter  id_tmonth
0       April   247302.16                       1.0          1
1       April   245002.16                       1.0          2
2         May   403108.57                       1.0          3
3        June   569325.85                       1.0          4
4        July   726491.90                       2.0          5
5      August   736090.39                       2.0          6
6   September   618978.79                       2.0          7
7     October   254193.67                       3.0          8
8        June    13771.73                       4.0          9
9        July   114532.23                       5.0         10
10     August   343826.51                       5.0         11
11  September   126928.45                       5.0         12
12   February     5500.00                       6.0         13
13   February    12000.00                       6.0         14
14       June   103483.77                       7.0         15
15       July   574118.08                       8.0         16
16       July   574018.08                       8.0         17
17     August   490184.02                       8.0         18
18  September    82670.59                       8.0         19
19    January     4000.00                       9.0         20
20    January     3000.00                       9.0         21
21      March     7000.00                       9.0         22
22        May    99235.59                      10.0         23
23       June   515695.51                      10.0         24
24       July   663455.67                      11.0         25
25     August   406735.50                      11.0         26
26  September   479023.23                      11.0         27
27    October    82970.86                      12.0         28
28    January     5000.00                      13.0         29
29    January     9000.00                      13.0         30
30      April   250895.64                      14.0         31
31        May   451333.46                      14.0         32
32       June   694530.47                      14.0         33
33       June   700930.47                      14.0         34
34       July   971796.46                      15.0         35
35     August  1075928.79                      15.0         36
36  September   848589.54                      15.0         37
37    October   168592.17                      16.0         38

In [80]:
new_column_order = ['id_tmonth', 'month', 'dim_tquarter_id_tquarter', 'profit']
merged_price_month = merged_price_month[new_column_order]
merged_price_month

    id_tmonth      month  dim_tquarter_id_tquarter      profit
0           1      April                       1.0   247302.16
1           2      April                       1.0   245002.16
2           3        May                       1.0   403108.57
3           4       June                       1.0   569325.85
4           5       July                       2.0   726491.90
5           6     August                       2.0   736090.39
6           7  September                       2.0   618978.79
7           8    October                       3.0   254193.67
8           9       June                       4.0    13771.73
9          10       July                       5.0   114532.23
10         11     August                       5.0   343826.51
11         12  September                       5.0   126928.45
12         13   February                       6.0     5500.00
13         14   February                       6.0    12000.00
14         15       June                       7.0   103483.77
15         16       July                       8.0   574118.08
16         17       July                       8.0   574018.08
17         18     August                       8.0   490184.02
18         19  September                       8.0    82670.59
19         20    January                       9.0     4000.00
20         21    January                       9.0     3000.00
21         22      March                       9.0     7000.00
22         23        May                      10.0    99235.59
23         24       June                      10.0   515695.51
24         25       July                      11.0   663455.67
25         26     August                      11.0   406735.50
26         27  September                      11.0   479023.23
27         28    October                      12.0    82970.86
28         29    January                      13.0     5000.00
29         30    January                      13.0     9000.00
30         31      April                      14.0   250895.64
31         32        May                      14.0   451333.46
32         33       June                      14.0   694530.47
33         34       June                      14.0   700930.47
34         35       July                      15.0   971796.46
35         36     August                      15.0  1075928.79
36         37  September                      15.0   848589.54
37         38    October                      16.0   168592.17

In [81]:
merged_price_month_to_list = list(merged_price_month.itertuples(index=False, name=None))
query_insert_dim_tmonth = """ INSERT INTO dim_tmonth (id_tmonth, month, dim_tquarter_id_tquarter, profit) 
                                VALUES (:1, :2, :3, :4)"""
write(merged_price_month_to_list, query_insert_dim_tmonth)

ORA-00001: unique constraint (ODIDATA.DIM_TMONTH_PK) violated

# Fact_Busy

In [82]:
dim_apartment = read('dim_apartment')
dim_apartment

   idapartment  room                                             name  bed
0            1     4  One-Bedroom Apartment with Balcony and Sea View    4
1            2     2                   Studio with Patio and Sea View    2
2            3     4    One-Bedroom Apartment with Patio and Sea View    4
3            4     2                                Studio with Patio    2

In [83]:
dim_grade_category = read('dim_gradecategory')
dim_grade_category

   idgradecategory  mingrade  maxgrade   category
0                1       1.0       2.0  Very poor
1                2       3.0       4.0       Poor
2                3       5.0       6.0   Passable
3                4       7.0       8.0       Good
4                5       9.0      10.0     Superb

In [11]:
dim_tyear = read('dim_tyear')
dim_tyear

   idtime_year   profit  year
0            1  3531291  2019
1            2   595859  2020
2            3  1255456  2021
3            4  2245116  2022
4            5  4460667  2023

In [84]:
data_fact_busy = data.copy()
data_fact_busy.head()

,Id,Book Number,Booked By,Guest Name,Start Date,End Date,Booked On,Status,Rooms,Number Of People,...,Cleanliness,Comfort,Value For Money,Location,Free WiFi,Accommodation Type,Number Of Nights,year,month,quarter
0,0,2245705225.0,Veeravalli Gopi,Gopi Veeravalli,2019-04-03,06.04.2019,30.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,NaN,2019,2019-04,2
1,1,2071623069.0,Kretov Nikita,Nikita Kretov,2019-04-06,11.04.2019,01.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,NaN,2019,2019-04,2
2,2,3037388122.0,Yuheng Huang,Yuheng Huang,2019-04-07,08.04.2019,31.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,NaN,2019,2019-04,2
3,3,3181654986.0,Li Fengju,Fengju Li,2019-04-10,11.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,D,NaN,2019,2019-04,2
4,4,3642008503.0,Li Fengju,NaN,2019-04-11,12.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,NaN,2019,2019-04,2

In [85]:
fact_busy = dim_apartment.copy()
fact_busy

   idapartment  room                                             name  bed
0            1     4  One-Bedroom Apartment with Balcony and Sea View    4
1            2     2                   Studio with Patio and Sea View    2
2            3     4    One-Bedroom Apartment with Patio and Sea View    4
3            4     2                                Studio with Patio    2

In [86]:
columns_to_drop = ['bed', 'room']
fact_busy = fact_busy.drop(columns=columns_to_drop)
fact_busy

   idapartment                                             name
0            1  One-Bedroom Apartment with Balcony and Sea View
1            2                   Studio with Patio and Sea View
2            3    One-Bedroom Apartment with Patio and Sea View
3            4                                Studio with Patio

In [87]:
result1 = data_fact_busy.loc[data_fact_busy['Accommodation'] == 'One-Bedroom Apartment with Balcony and Sea View', ['year', 'Grade']]
result2 = data_fact_busy.loc[data_fact_busy['Accommodation'] == 'Studio with Patio and Sea View', ['year', 'Grade']]
result3 = data_fact_busy.loc[data_fact_busy['Accommodation'] == 'One-Bedroom Apartment with Patio and Sea View', ['year', 'Grade']]
result4 = data_fact_busy.loc[data_fact_busy['Accommodation'] == 'Studio with Patio', ['year', 'Grade']]

result1.dropna(subset=['Grade'], inplace=True)
result2.dropna(subset=['Grade'], inplace=True)
result3.dropna(subset=['Grade'], inplace=True)
result4.dropna(subset=['Grade'], inplace=True)

# Filter out zero values
non_zero_result1 = result1[result1['Grade'] != 0]
non_zero_result2 = result2[result2['Grade'] != 0]
non_zero_result3 = result3[result3['Grade'] != 0]
non_zero_result4 = result4[result4['Grade'] != 0]

# Check if there are non-zero values before calculating the average
if not non_zero_result1.empty:
    # Calculate the average grade excluding zero values
    average_grade1 = non_zero_result1.groupby('year')['Grade'].mean().round(2)
    result_df1 = pd.DataFrame({'year': average_grade1.index, 'Average_Grade': average_grade1.values})
    print("Average Grade (excluding zeros):", result_df1)
else:
    print("No non-zero grades found.")

if not non_zero_result2.empty:
    # Calculate the average grade excluding zero values
    average_grade2 = non_zero_result2.groupby('year')['Grade'].mean().round(2)
    result_df2 = pd.DataFrame({'year': average_grade2.index, 'Average_Grade': average_grade2.values})
    print("Average Grade (excluding zeros):", result_df2)
else:
    print("No non-zero grades found.")

if not non_zero_result3.empty:
    # Calculate the average grade excluding zero values
    average_grade3 = non_zero_result3.groupby('year')['Grade'].mean().round(2)
    result_df3 = pd.DataFrame({'year': average_grade3.index, 'Average_Grade': average_grade3.values})
    print("Average Grade (excluding zeros):", result_df3)
else:
    print("No non-zero grades found.")

if not non_zero_result4.empty:
    # Calculate the average grade excluding zero values
    average_grade4 = non_zero_result4.groupby('year')['Grade'].mean().round(2)
    result_df4 = pd.DataFrame({'year': average_grade4.index, 'Average_Grade': average_grade4.values})
    print("Average Grade (excluding zeros):", result_df4)
else:
    print("No non-zero grades found.")

Average Grade (excluding zeros):    year  Average_Grade
0  2019           8.67
1  2020           8.90
2  2022           8.75
3  2023           9.06
Average Grade (excluding zeros):    year  Average_Grade
0  2019           8.29
1  2020           8.57
2  2022           8.40
3  2023           8.98
Average Grade (excluding zeros):    year  Average_Grade
0  2019           8.44
1  2020           8.57
2  2022           8.29
3  2023           9.14
Average Grade (excluding zeros):    year  Average_Grade
0  2019           8.42
1  2020           8.67
2  2021           7.50
3  2022           8.44
4  2023           9.12

In [88]:
concatenated_df = pd.concat([result_df1, result_df2, result_df3, result_df4], axis=0, ignore_index=True)

# Display the resulting DataFrame
print("Concatenated DataFrame:\n", concatenated_df)

Concatenated DataFrame:
     year  Average_Grade
0   2019           8.67
1   2020           8.90
2   2022           8.75
3   2023           9.06
4   2019           8.29
5   2020           8.57
6   2022           8.40
7   2023           8.98
8   2019           8.44
9   2020           8.57
10  2022           8.29
11  2023           9.14
12  2019           8.42
13  2020           8.67
14  2021           7.50
15  2022           8.44
16  2023           9.12

In [89]:
concatenated_df['dim_gradecat_idgradecat'] = [4,4,4,5,4,4,4,4,4,4,4,5,4,4,4,4,5]

concatenated_df['dim_apartment_idapartment'] = [1,1,1,1,2,2,2,2,3,3,3,3,4,4,4,4,4]
concatenated_df

    year  Average_Grade  dim_gradecat_idgradecat  dim_apartment_idapartment
0   2019           8.67                        4                          1
1   2020           8.90                        4                          1
2   2022           8.75                        4                          1
3   2023           9.06                        5                          1
4   2019           8.29                        4                          2
5   2020           8.57                        4                          2
6   2022           8.40                        4                          2
7   2023           8.98                        4                          2
8   2019           8.44                        4                          3
9   2020           8.57                        4                          3
10  2022           8.29                        4                          3
11  2023           9.14                        5                          3
12  2019           8.42                        4                          4
13  2020           8.67                        4                          4
14  2021           7.50                        4                          4
15  2022           8.44                        4                          4
16  2023           9.12                        5                          4

In [90]:
data_fact_busy.head()

,Id,Book Number,Booked By,Guest Name,Start Date,End Date,Booked On,Status,Rooms,Number Of People,...,Cleanliness,Comfort,Value For Money,Location,Free WiFi,Accommodation Type,Number Of Nights,year,month,quarter
0,0,2245705225.0,Veeravalli Gopi,Gopi Veeravalli,2019-04-03,06.04.2019,30.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,NaN,2019,2019-04,2
1,1,2071623069.0,Kretov Nikita,Nikita Kretov,2019-04-06,11.04.2019,01.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,NaN,2019,2019-04,2
2,2,3037388122.0,Yuheng Huang,Yuheng Huang,2019-04-07,08.04.2019,31.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,NaN,2019,2019-04,2
3,3,3181654986.0,Li Fengju,Fengju Li,2019-04-10,11.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,D,NaN,2019,2019-04,2
4,4,3642008503.0,Li Fengju,NaN,2019-04-11,12.04.2019,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,NaN,2019,2019-04,2

In [91]:
selected_columns = ['Status', 'year', 'Accommodation', 'Grade', 'Start Date', 'End Date', 'Number Of Nights']
data_fact_busy22 = data_fact_busy[selected_columns]

data_fact_busy22['Start Date'] = pd.to_datetime(data_fact_busy22['Start Date'], format='%d.%m.%Y')
data_fact_busy22['End Date'] = pd.to_datetime(data_fact_busy22['End Date'], format='%d.%m.%Y')
data_fact_busy22['Number Of Nights'] = (data_fact_busy22['End Date'] - data_fact_busy22['Start Date']).dt.days
data_fact_busy22

C:\Users\k\AppData\Local\Temp\ipykernel_7412\2518070398.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_busy22['Start Date'] = pd.to_datetime(data_fact_busy22['Start Date'], format='%d.%m.%Y')
C:\Users\k\AppData\Local\Temp\ipykernel_7412\2518070398.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_busy22['End Date'] = pd.to_datetime(data_fact_busy22['End Date'], format='%d.%m.%Y')
C:\Users\k\AppData\Local\Temp\ipykernel_7412\2518070398.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_busy22['Number Of Nights'] = (data_fact_busy22['End Date'] - data_fact_busy22['Start Date']).dt.days

,Status,year,Accommodation,Grade,Start Date,End Date,Number Of Nights
0,Confirmed,2019,One-Bedroom Apartment with Balcony and Sea View,10.0,2019-04-03,2019-04-06,3
1,Confirmed,2019,One-Bedroom Apartment with Balcony and Sea View,0.0,2019-04-06,2019-04-11,5
2,Confirmed,2019,Studio with Patio and Sea View,0.0,2019-04-07,2019-04-08,1
3,Confirmed,2019,One-Bedroom Apartment with Patio and Sea View,8.0,2019-04-10,2019-04-11,1
4,Confirmed,2019,Studio with Patio and Sea View,8.0,2019-04-11,2019-04-12,1
...,...,...,...,...,...,...,...
700,Confirmed,2023,One-Bedroom Apartment with Patio and Sea View,8.8,2023-07-16,2023-07-21,5
701,Confirmed,2023,One-Bedroom Apartment with Balcony and Sea View,7.7,2023-07-14,2023-07-17,3
702,Cancelled,2023,Studio with Patio and Sea View,0.0,2023-05-26,2023-05-28,2
703,Confirmed,2023,Studio with Patio and Sea View,0.0,2023-09-24,2023-09-26,2
704,Confirmed,2023,Studio with Patio and Sea View,0.0,2023-09-27,2023-09-29,2

In [92]:
data_fact_busy22['year'] = data_fact_busy22['Start Date'].astype(str).str[:4]
data_fact_busy22

C:\Users\k\AppData\Local\Temp\ipykernel_7412\2903943610.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_busy22['year'] = data_fact_busy22['Start Date'].astype(str).str[:4]

,Status,year,Accommodation,Grade,Start Date,End Date,Number Of Nights
0,Confirmed,2019,One-Bedroom Apartment with Balcony and Sea View,10.0,2019-04-03,2019-04-06,3
1,Confirmed,2019,One-Bedroom Apartment with Balcony and Sea View,0.0,2019-04-06,2019-04-11,5
2,Confirmed,2019,Studio with Patio and Sea View,0.0,2019-04-07,2019-04-08,1
3,Confirmed,2019,One-Bedroom Apartment with Patio and Sea View,8.0,2019-04-10,2019-04-11,1
4,Confirmed,2019,Studio with Patio and Sea View,8.0,2019-04-11,2019-04-12,1
...,...,...,...,...,...,...,...
700,Confirmed,2023,One-Bedroom Apartment with Patio and Sea View,8.8,2023-07-16,2023-07-21,5
701,Confirmed,2023,One-Bedroom Apartment with Balcony and Sea View,7.7,2023-07-14,2023-07-17,3
702,Cancelled,2023,Studio with Patio and Sea View,0.0,2023-05-26,2023-05-28,2
703,Confirmed,2023,Studio with Patio and Sea View,0.0,2023-09-24,2023-09-26,2
704,Confirmed,2023,Studio with Patio and Sea View,0.0,2023-09-27,2023-09-29,2

In [93]:
data_fact_busy22CON = data_fact_busy22[data_fact_busy22['Status'] == 'Confirmed']

sum_nights_by_year = (data_fact_busy22CON.groupby(['year', 'Accommodation'])['Number Of Nights'].sum() * 100 / 365).round(2)

result_df = sum_nights_by_year.reset_index(name='Percent')

print("Resulting DataFrame:\n", result_df)

Resulting DataFrame:
     year                                    Accommodation  Percent
0   2019  One-Bedroom Apartment with Balcony and Sea View    47.95
1   2019    One-Bedroom Apartment with Patio and Sea View    48.77
2   2019                                Studio with Patio    33.42
3   2019                   Studio with Patio and Sea View    47.95
4   2020  One-Bedroom Apartment with Balcony and Sea View    12.60
5   2020    One-Bedroom Apartment with Patio and Sea View    10.41
6   2020                                Studio with Patio     4.38
7   2020                   Studio with Patio and Sea View     8.77
8   2021  One-Bedroom Apartment with Balcony and Sea View    13.42
9   2021    One-Bedroom Apartment with Patio and Sea View    14.25
10  2021                                Studio with Patio    16.44
11  2021                   Studio with Patio and Sea View    18.63
12  2022  One-Bedroom Apartment with Balcony and Sea View    29.59
13  2022    One-Bedroom Apartment with Patio and Sea View    37.81
14  2022                                Studio with Patio    24.11
15  2022                   Studio with Patio and Sea View    28.22
16  2023  One-Bedroom Apartment with Balcony and Sea View    36.99
17  2023    One-Bedroom Apartment with Patio and Sea View    33.97
18  2023                                Studio with Patio    28.22
19  2023                   Studio with Patio and Sea View    37.26

In [94]:
numeric_to_year = {'2019' : '1', '2020':'2', '2021':'3', '2022':4, '2023':'5'}
numeric_to_accommodation = {'One-Bedroom Apartment with Balcony and Sea View' : '1', 
                            'One-Bedroom Apartment with Patio and Sea View':'3', 
                            'Studio with Patio':'4', 
                            'Studio with Patio and Sea View':'2'}
result_df['year'] = result_df['year'].map(numeric_to_year)
result_df['Accommodation'] = result_df['Accommodation'].map(numeric_to_accommodation)
result_df

   year Accommodation  Percent
0     1             1    47.95
1     1             3    48.77
2     1             4    33.42
3     1             2    47.95
4     2             1    12.60
5     2             3    10.41
6     2             4     4.38
7     2             2     8.77
8     3             1    13.42
9     3             3    14.25
10    3             4    16.44
11    3             2    18.63
12    4             1    29.59
13    4             3    37.81
14    4             4    24.11
15    4             2    28.22
16    5             1    36.99
17    5             3    33.97
18    5             4    28.22
19    5             2    37.26

In [95]:
result_df['dim_gradecat_idgradecat'] = [4,4,4,4,4,4,4,4, 6,6, 6,4,4,4,4,4,5,4,5,5]
result_df

   year Accommodation  Percent  dim_gradecat_idgradecat
0     1             1    47.95                        4
1     1             3    48.77                        4
2     1             4    33.42                        4
3     1             2    47.95                        4
4     2             1    12.60                        4
5     2             3    10.41                        4
6     2             4     4.38                        4
7     2             2     8.77                        4
8     3             1    13.42                        6
9     3             3    14.25                        6
10    3             4    16.44                        6
11    3             2    18.63                        4
12    4             1    29.59                        4
13    4             3    37.81                        4
14    4             4    24.11                        4
15    4             2    28.22                        4
16    5             1    36.99                        5
17    5             3    33.97                        4
18    5             4    28.22                        5
19    5             2    37.26                        5

In [96]:
result_df['idbusy'] = range(1, len(result_df) + 1)
result_df

   year Accommodation  Percent  dim_gradecat_idgradecat  idbusy
0     1             1    47.95                        4       1
1     1             3    48.77                        4       2
2     1             4    33.42                        4       3
3     1             2    47.95                        4       4
4     2             1    12.60                        4       5
5     2             3    10.41                        4       6
6     2             4     4.38                        4       7
7     2             2     8.77                        4       8
8     3             1    13.42                        6       9
9     3             3    14.25                        6      10
10    3             4    16.44                        6      11
11    3             2    18.63                        4      12
12    4             1    29.59                        4      13
13    4             3    37.81                        4      14
14    4             4    24.11                        4      15
15    4             2    28.22                        4      16
16    5             1    36.99                        5      17
17    5             3    33.97                        4      18
18    5             4    28.22                        5      19
19    5             2    37.26                        5      20

In [97]:
new_column_names = {'Accommodation': 'dim_apartment_idapartment', 'Percent' : 'busy', 'year' : 'dim_tyear_id_year'}
result_df = result_df.rename(columns=new_column_names)
result_df

,dim_tyear_id_year,dim_apartment_idapartment,busy,dim_gradecat_idgradecat,idbusy
0,1,1,47.95,4,1
1,1,3,48.77,4,2
2,1,4,33.42,4,3
3,1,2,47.95,4,4
4,2,1,12.60,4,5
5,2,3,10.41,4,6
6,2,4,4.38,4,7
7,2,2,8.77,4,8
8,3,1,13.42,6,9
9,3,3,14.25,6,10
10,3,4,16.44,6,11
11,3,2,18.63,4,12
12,4,1,29.59,4,13
13,4,3,37.81,4,14
14,4,4,24.11,4,15
15,4,2,28.22,4,16
16,5,1,36.99,5,17
17,5,3,33.97,4,18
18,5,4,28.22,5,19
19,5,2,37.26,5,20

In [98]:
new_column_order = ['idbusy', 'busy', 'dim_gradecat_idgradecat', 'dim_apartment_idapartment', 'dim_tyear_id_year']
result_df = result_df[new_column_order]
result_df

,idbusy,busy,dim_gradecat_idgradecat,dim_apartment_idapartment,dim_tyear_id_year
0,1,47.95,4,1,1
1,2,48.77,4,3,1
2,3,33.42,4,4,1
3,4,47.95,4,2,1
4,5,12.60,4,1,2
5,6,10.41,4,3,2
6,7,4.38,4,4,2
7,8,8.77,4,2,2
8,9,13.42,6,1,3
9,10,14.25,6,3,3
10,11,16.44,6,4,3
11,12,18.63,4,2,3
12,13,29.59,4,1,4
13,14,37.81,4,3,4
14,15,24.11,4,4,4
15,16,28.22,4,2,4
16,17,36.99,5,1,5
17,18,33.97,4,3,5
18,19,28.22,5,4,5
19,20,37.26,5,2,5

In [99]:
result_df['dim_gradecat_idgradecat'] = result_df['dim_gradecat_idgradecat'].astype(int)
result_df['dim_apartment_idapartment'] = result_df['dim_apartment_idapartment'].astype(int)
result_df['dim_tyear_id_year'] = result_df['dim_tyear_id_year'].astype(int)

In [113]:
data_fact_busy_to_list = list(result_df.itertuples(index=False, name=None))
query_insert_data_fact_busy = """   INSERT INTO fact_busy (idbusy, busy, dim_gradecat_idgradecat, dim_apartment_idapartment, dim_tyear_idtime_year) 
                                    VALUES (:1, :2, :3, :4, :5)"""
write(data_fact_busy_to_list, query_insert_data_fact_busy)

ORA-00001: unique constraint (ODIDATA.FACT_BUSY_PK) violated

# Fack_Cancelation

In [251]:
data_fact_cancelation = data.copy()
data_fact_cancelation.columns

Index(['Id', 'Book Number', 'Booked By', 'Guest Name', 'Start Date',
       'End Date', 'Booked On', 'Status', 'Rooms', 'Number Of People',
       'Number Of Adults', 'Number Of Children', 'Children's Age', 'Price_EUR',
       'Commission Percentage', 'Commission Amount', 'Payment Status',
       'Payment Method', 'Accommodation', 'Grade', 'Advertiser',
       'Price_DOLLAR', 'Price_RSD', 'Contact', 'Staff', 'Facilities',
       'Cleanliness', 'Comfort', 'Value For Money', 'Location', 'Free WiFi',
       'Accommodation Type', 'Number Of Nights', 'year', 'month', 'quarter'],
      dtype='object')

In [252]:
selected_columns = ['Status', 'Accommodation', 'year', 'month']
data_fact_cancelation = data_fact_cancelation[selected_columns]
data_fact_cancelation

        Status                                    Accommodation  year    month
0    Confirmed  One-Bedroom Apartment with Balcony and Sea View  2019  2019-04
1    Confirmed  One-Bedroom Apartment with Balcony and Sea View  2019  2019-04
2    Confirmed                   Studio with Patio and Sea View  2019  2019-04
3    Confirmed    One-Bedroom Apartment with Patio and Sea View  2019  2019-04
4    Confirmed                   Studio with Patio and Sea View  2019  2019-04
..         ...                                              ...   ...      ...
700  Confirmed    One-Bedroom Apartment with Patio and Sea View  2023  2023-07
701  Confirmed  One-Bedroom Apartment with Balcony and Sea View  2023  2023-07
702  Cancelled                   Studio with Patio and Sea View  2023  2023-05
703  Confirmed                   Studio with Patio and Sea View  2023  2023-09
704  Confirmed                   Studio with Patio and Sea View  2023  2023-09

[705 rows x 4 columns]

In [116]:
data_fact_cancelation['month'] = data_fact_cancelation['month'].astype(str).str[5:]
data_fact_cancelation

        Status                                    Accommodation  year month
0    Confirmed  One-Bedroom Apartment with Balcony and Sea View  2019    04
1    Confirmed  One-Bedroom Apartment with Balcony and Sea View  2019    04
2    Confirmed                   Studio with Patio and Sea View  2019    04
3    Confirmed    One-Bedroom Apartment with Patio and Sea View  2019    04
4    Confirmed                   Studio with Patio and Sea View  2019    04
..         ...                                              ...   ...   ...
700  Confirmed    One-Bedroom Apartment with Patio and Sea View  2023    07
701  Confirmed  One-Bedroom Apartment with Balcony and Sea View  2023    07
702  Cancelled                   Studio with Patio and Sea View  2023    05
703  Confirmed                   Studio with Patio and Sea View  2023    09
704  Confirmed                   Studio with Patio and Sea View  2023    09

[705 rows x 4 columns]

In [117]:
numeric_to_accommodation = {'One-Bedroom Apartment with Balcony and Sea View' : '1', 
                            'One-Bedroom Apartment with Patio and Sea View':'3', 
                            'Studio with Patio':'4', 
                            'Studio with Patio and Sea View':'2'}
data_fact_cancelation['Accommodation'] = data_fact_cancelation['Accommodation'].map(numeric_to_accommodation)
data_fact_cancelation

        Status Accommodation  year month
0    Confirmed             1  2019    04
1    Confirmed             1  2019    04
2    Confirmed             2  2019    04
3    Confirmed             3  2019    04
4    Confirmed             2  2019    04
..         ...           ...   ...   ...
700  Confirmed             3  2023    07
701  Confirmed             1  2023    07
702  Cancelled             2  2023    05
703  Confirmed             2  2023    09
704  Confirmed             2  2023    09

[705 rows x 4 columns]

In [118]:
columns_to_convert = ['year', 'month']
data_fact_cancelation[columns_to_convert] = data_fact_cancelation[columns_to_convert].astype(str)
data_fact_cancelation

        Status Accommodation  year month
0    Confirmed             1  2019    04
1    Confirmed             1  2019    04
2    Confirmed             2  2019    04
3    Confirmed             3  2019    04
4    Confirmed             2  2019    04
..         ...           ...   ...   ...
700  Confirmed             3  2023    07
701  Confirmed             1  2023    07
702  Cancelled             2  2023    05
703  Confirmed             2  2023    09
704  Confirmed             2  2023    09

[705 rows x 4 columns]

In [119]:
data_fact_cancelation['month2'] = np.nan
for index, row in data_fact_cancelation.iterrows():
    if row['year'] == "2019":
        if row['month'] == "04":
            data_fact_cancelation.at[index, 'month2'] = 1
        if row['month'] == "05":
            data_fact_cancelation.at[index, 'month2'] = 2
        if row['month'] == "06":
            data_fact_cancelation.at[index, 'month2'] = 3
        if row['month'] == "07":
            data_fact_cancelation.at[index, 'month2'] = 4
        if row['month'] == "08":
            data_fact_cancelation.at[index, 'month2'] = 5
        if row['month'] == "09":
            data_fact_cancelation.at[index, 'month2'] = 6
        if row['month'] == "10":
            data_fact_cancelation.at[index, 'month2'] = 7
    if row['year'] == "2020":        
        if row['month'] == "06":
            data_fact_cancelation.at[index, 'month2'] = 8
        if row['month'] == "07":
            data_fact_cancelation.at[index, 'month2'] = 9
        if row['month'] == "08":
            data_fact_cancelation.at[index, 'month2'] = 10
        if row['month'] == "09":
            data_fact_cancelation.at[index, 'month2'] = 11
    if row['year'] == "2021":        
        if row['month'] == "02":
            data_fact_cancelation.at[index, 'month2'] = 12
        if row['month'] == "06":
            data_fact_cancelation.at[index, 'month2'] = 13
        if row['month'] == "07":
            data_fact_cancelation.at[index, 'month2'] = 14
        if row['month'] == "08":
            data_fact_cancelation.at[index, 'month2'] = 15
        if row['month'] == "09":
            data_fact_cancelation.at[index, 'month2'] = 16
    if row['year'] == "2022":        
        if row['month'] == "01":
            data_fact_cancelation.at[index, 'month2'] = 17
        if row['month'] == "03":
            data_fact_cancelation.at[index, 'month2'] = 18
        if row['month'] == "05":
            data_fact_cancelation.at[index, 'month2'] = 19
        if row['month'] == "06":
            data_fact_cancelation.at[index, 'month2'] = 20
        if row['month'] == "07":
            data_fact_cancelation.at[index, 'month2'] = 21
        if row['month'] == "08":
            data_fact_cancelation.at[index, 'month2'] = 22
        if row['month'] == "09":
            data_fact_cancelation.at[index, 'month2'] = 23
        if row['month'] == "10":
            data_fact_cancelation.at[index, 'month2'] = 24
    if row['year'] == "2023":        
        if row['month'] == "01":
            data_fact_cancelation.at[index, 'month2'] = 26
        if row['month'] == "04":
            data_fact_cancelation.at[index, 'month2'] = 27
        if row['month'] == "05":
            data_fact_cancelation.at[index, 'month2'] = 28
        if row['month'] == "06":
            data_fact_cancelation.at[index, 'month2'] = 29
        if row['month'] == "07":
            data_fact_cancelation.at[index, 'month2'] = 30
        if row['month'] == "08":
            data_fact_cancelation.at[index, 'month2'] = 31
        if row['month'] == "09":
            data_fact_cancelation.at[index, 'month2'] = 32
        if row['month'] == "10":
            data_fact_cancelation.at[index, 'month2'] = 33
        if row['month'] == "10":
            data_fact_cancelation.at[index, 'month2'] = 34

# data_fact_cancelation

In [120]:
data_fact_cancelation['month2'].unique()

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  9., 10., 11., 14., 13., 15.,
       16., 19., 20., 21., 23., 22., 27., 28., 29., 30., 31., 32., 34.,
        8., 24.])

In [121]:
data_fact_cancelation

        Status Accommodation  year month  month2
0    Confirmed             1  2019    04     1.0
1    Confirmed             1  2019    04     1.0
2    Confirmed             2  2019    04     1.0
3    Confirmed             3  2019    04     1.0
4    Confirmed             2  2019    04     1.0
..         ...           ...   ...   ...     ...
700  Confirmed             3  2023    07    30.0
701  Confirmed             1  2023    07    30.0
702  Cancelled             2  2023    05    28.0
703  Confirmed             2  2023    09    32.0
704  Confirmed             2  2023    09    32.0

[705 rows x 5 columns]

In [122]:
numeric_to_status = {'Arriving' : 1, 'Cancelled': 1, 'NoShow': 1, 'Confirmed': 0}
data_fact_cancelation['NumberOfCancelation'] = data_fact_cancelation['Status'].map(numeric_to_status)
data_fact_cancelation

        Status Accommodation  year month  month2  NumberOfCancelation
0    Confirmed             1  2019    04     1.0                    0
1    Confirmed             1  2019    04     1.0                    0
2    Confirmed             2  2019    04     1.0                    0
3    Confirmed             3  2019    04     1.0                    0
4    Confirmed             2  2019    04     1.0                    0
..         ...           ...   ...   ...     ...                  ...
700  Confirmed             3  2023    07    30.0                    0
701  Confirmed             1  2023    07    30.0                    0
702  Cancelled             2  2023    05    28.0                    1
703  Confirmed             2  2023    09    32.0                    0
704  Confirmed             2  2023    09    32.0                    0

[705 rows x 6 columns]

In [123]:
data_fact_cancelation = data_fact_cancelation.rename(columns={'Accommodation': 'Dim_Apartment_IdApartment', 'month2': 'Dim_Tmonth_Id_Tmonth'})
data_fact_cancelation

,Status,Dim_Apartment_IdApartment,year,month,Dim_Tmonth_Id_Tmonth,NumberOfCancelation
0,Confirmed,1,2019,04,1.0,0
1,Confirmed,1,2019,04,1.0,0
2,Confirmed,2,2019,04,1.0,0
3,Confirmed,3,2019,04,1.0,0
4,Confirmed,2,2019,04,1.0,0
...,...,...,...,...,...,...
700,Confirmed,3,2023,07,30.0,0
701,Confirmed,1,2023,07,30.0,0
702,Cancelled,2,2023,05,28.0,1
703,Confirmed,2,2023,09,32.0,0
704,Confirmed,2,2023,09,32.0,0

In [124]:
columns_to_drop = ['Status', 'year', 'month']
data_fact_cancelation.drop(columns=columns_to_drop, inplace=True)
data_fact_cancelation

    Dim_Apartment_IdApartment  Dim_Tmonth_Id_Tmonth  NumberOfCancelation
0                           1                   1.0                    0
1                           1                   1.0                    0
2                           2                   1.0                    0
3                           3                   1.0                    0
4                           2                   1.0                    0
..                        ...                   ...                  ...
700                         3                  30.0                    0
701                         1                  30.0                    0
702                         2                  28.0                    1
703                         2                  32.0                    0
704                         2                  32.0                    0

[705 rows x 3 columns]

In [125]:
data_fact_cancelation['IdCancel'] = range(1, len(data_fact_cancelation) + 1)
data_fact_cancelation

,Dim_Apartment_IdApartment,Dim_Tmonth_Id_Tmonth,NumberOfCancelation,IdCancel
0,1,1.0,0,1
1,1,1.0,0,2
2,2,1.0,0,3
3,3,1.0,0,4
4,2,1.0,0,5
...,...,...,...,...
700,3,30.0,0,701
701,1,30.0,0,702
702,2,28.0,1,703
703,2,32.0,0,704
704,2,32.0,0,705

In [126]:
new_column_order = ['IdCancel', 'NumberOfCancelation', 'Dim_Apartment_IdApartment', 'Dim_Tmonth_Id_Tmonth']
data_fact_cancelation = data_fact_cancelation[new_column_order]
data_fact_cancelation

,IdCancel,NumberOfCancelation,Dim_Apartment_IdApartment,Dim_Tmonth_Id_Tmonth
0,1,0,1,1.0
1,2,0,1,1.0
2,3,0,2,1.0
3,4,0,3,1.0
4,5,0,2,1.0
...,...,...,...,...
700,701,0,3,30.0
701,702,0,1,30.0
702,703,1,2,28.0
703,704,0,2,32.0
704,705,0,2,32.0

In [127]:
data_fact_cancelation_to_list = list(data_fact_cancelation.itertuples(index=False, name=None))
query_insert_data_fact_cancelation = """   INSERT INTO fact_cancel (idcancel, numberofcancelation, dim_apartment_idapartment, dim_tmonth_id_tmonth) VALUES (:1, :2, :3, :4)"""
write(data_fact_cancelation_to_list, query_insert_data_fact_cancelation)

ORA-00001: unique constraint (ODIDATA.FACT_CANCEL_PK) violated

# Fact_Profit

In [279]:
data_fact_profit = data.copy()

In [280]:
data_fact_profit['Start Date'] = pd.to_datetime(data_fact_profit['Start Date'], format='%d.%m.%Y')
data_fact_profit['End Date'] = pd.to_datetime(data_fact_profit['End Date'], format='%d.%m.%Y')
data_fact_profit['Number Of Nights'] = (data_fact_profit['End Date'] - data_fact_profit['Start Date']).dt.days
data_fact_profit['Number Of Nights'].unique()

array([ 3,  5,  1,  2,  4,  6,  7,  8, 14, 12, 13, 10,  9, 11],
      dtype=int64)

In [281]:
data_fact_profit.columns

Index(['Id', 'Book Number', 'Booked By', 'Guest Name', 'Start Date',
       'End Date', 'Booked On', 'Status', 'Rooms', 'Number Of People',
       'Number Of Adults', 'Number Of Children', 'Children's Age', 'Price_EUR',
       'Commission Percentage', 'Commission Amount', 'Payment Status',
       'Payment Method', 'Accommodation', 'Grade', 'Advertiser',
       'Price_DOLLAR', 'Price_RSD', 'Contact', 'Staff', 'Facilities',
       'Cleanliness', 'Comfort', 'Value For Money', 'Location', 'Free WiFi',
       'Accommodation Type', 'Number Of Nights', 'year', 'month', 'quarter'],
      dtype='object')

In [282]:
data_fact_profit.head()

,Id,Book Number,Booked By,Guest Name,Start Date,End Date,Booked On,Status,Rooms,Number Of People,...,Cleanliness,Comfort,Value For Money,Location,Free WiFi,Accommodation Type,Number Of Nights,year,month,quarter
0,0,2245705225.0,Veeravalli Gopi,Gopi Veeravalli,2019-04-03,2019-04-06,30.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,3,2019,2019-04,2
1,1,2071623069.0,Kretov Nikita,Nikita Kretov,2019-04-06,2019-04-11,01.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,A,5,2019,2019-04,2
2,2,3037388122.0,Yuheng Huang,Yuheng Huang,2019-04-07,2019-04-08,31.03.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,1,2019,2019-04,2
3,3,3181654986.0,Li Fengju,Fengju Li,2019-04-10,2019-04-11,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,D,1,2019,2019-04,2
4,4,3642008503.0,Li Fengju,NaN,2019-04-11,2019-04-12,02.04.2019,Confirmed,1.0,2,...,NaN,NaN,NaN,NaN,NaN,C,1,2019,2019-04,2

In [283]:
data_fact_profit['month'] = data_fact_profit['month'].astype(str).str[5:]
data_fact_profit['month'].unique()

array(['04', '05', '06', '07', '08', '09', '10'], dtype=object)

In [284]:
columns_to_convert = ['year', 'month']
data_fact_profit[columns_to_convert] = data_fact_profit[columns_to_convert].astype(str)

In [285]:
data_Booking = data_fact_profit[data_fact_profit['Advertiser'] == 'Booking']
data_Airbnb = data_fact_profit[data_fact_profit['Advertiser'] == 'Airbnb']

In [286]:
data_Booking.columns

Index(['Id', 'Book Number', 'Booked By', 'Guest Name', 'Start Date',
       'End Date', 'Booked On', 'Status', 'Rooms', 'Number Of People',
       'Number Of Adults', 'Number Of Children', 'Children's Age', 'Price_EUR',
       'Commission Percentage', 'Commission Amount', 'Payment Status',
       'Payment Method', 'Accommodation', 'Grade', 'Advertiser',
       'Price_DOLLAR', 'Price_RSD', 'Contact', 'Staff', 'Facilities',
       'Cleanliness', 'Comfort', 'Value For Money', 'Location', 'Free WiFi',
       'Accommodation Type', 'Number Of Nights', 'year', 'month', 'quarter'],
      dtype='object')

In [261]:
data_Airbnb.columns

Index(['Id', 'Book Number', 'Booked By', 'Guest Name', 'Start Date',
       'End Date', 'Booked On', 'Status', 'Rooms', 'Number Of People',
       'Number Of Adults', 'Number Of Children', 'Children's Age', 'Price_EUR',
       'Commission Percentage', 'Commission Amount', 'Payment Status',
       'Payment Method', 'Accommodation', 'Grade', 'Advertiser',
       'Price_DOLLAR', 'Price_RSD', 'Contact', 'Staff', 'Facilities',
       'Cleanliness', 'Comfort', 'Value For Money', 'Location', 'Free WiFi',
       'Accommodation Type', 'Number Of Nights', 'year', 'month', 'quarter'],
      dtype='object')

In [287]:
selected_columns = ['Price_EUR', 'Accommodation','Number Of Nights', 'year', 'month']
data_fact_profit_Booking = data_Booking[selected_columns]
data_fact_profit_Booking

,Price_EUR,Accommodation,Number Of Nights,year,month
0,95.94,One-Bedroom Apartment with Balcony and Sea View,3,2019,04
1,164.00,One-Bedroom Apartment with Balcony and Sea View,5,2019,04
2,31.98,Studio with Patio and Sea View,1,2019,04
3,31.98,One-Bedroom Apartment with Patio and Sea View,1,2019,04
4,32.80,Studio with Patio and Sea View,1,2019,04
...,...,...,...,...,...
553,186.96,Studio with Patio and Sea View,4,2023,10
554,109.88,One-Bedroom Apartment with Patio and Sea View,2,2023,10
555,180.40,Studio with Patio,4,2023,10
556,164.82,One-Bedroom Apartment with Patio and Sea View,3,2023,10
557,216.48,One-Bedroom Apartment with Balcony and Sea View,4,2023,10

In [288]:
selected_columns = ['Price_DOLLAR', 'Accommodation','Number Of Nights', 'year', 'month']
data_fact_profit_Airbnb = data_Airbnb[selected_columns]
data_fact_profit_Airbnb

,Price_DOLLAR,Accommodation,Number Of Nights,year,month
558,63.90,Studio with Patio,2,2019,06
559,63.90,Studio with Patio,2,2019,06
560,31.95,Studio with Patio,1,2019,06
561,32.95,Studio with Patio,1,2019,06
562,63.90,Studio with Patio,2,2019,06
...,...,...,...,...,...
700,327.40,One-Bedroom Apartment with Patio and Sea View,5,2023,07
701,212.25,One-Bedroom Apartment with Balcony and Sea View,3,2023,07
702,86.62,Studio with Patio and Sea View,2,2023,05
703,100.76,Studio with Patio and Sea View,2,2023,09
704,100.76,Studio with Patio and Sea View,2,2023,09

In [289]:
accommodation_mapping = {'One-Bedroom Apartment with Balcony and Sea View': 1, 
                         'Studio with Patio and Sea View': 2, 
                         'Studio with Patio': 4, 
                         'One-Bedroom Apartment with Patio and Sea View': 3}

data_fact_profit_Booking['Accommodation'] = data_fact_profit_Booking['Accommodation'].map(accommodation_mapping)
data_fact_profit_Airbnb['Accommodation'] = data_fact_profit_Airbnb['Accommodation'].map(accommodation_mapping)

data_fact_profit_Booking['dim_currency_idcurrency'] = 2
data_fact_profit_Booking['dim_advertiser_idadvertiser'] = 1

data_fact_profit_Airbnb['dim_currency_idcurrency'] = 3
data_fact_profit_Airbnb['dim_advertiser_idadvertiser'] = 2

print(data_fact_profit_Booking)
print(data_fact_profit_Airbnb)

     Price_EUR  Accommodation  Number Of Nights  year month  \
0        95.94              1                 3  2019    04
1       164.00              1                 5  2019    04
2        31.98              2                 1  2019    04
3        31.98              3                 1  2019    04
4        32.80              2                 1  2019    04
..         ...            ...               ...   ...   ...
553     186.96              2                 4  2023    10
554     109.88              3                 2  2023    10
555     180.40              4                 4  2023    10
556     164.82              3                 3  2023    10
557     216.48              1                 4  2023    10

     dim_currency_idcurrency  dim_advertiser_idadvertiser
0                          2                            1
1                          2                            1
2                          2                            1
3                          2                            1
4                          2                            1
..                       ...                          ...
553                        2                            1
554                        2                            1
555                        2                            1
556                        2                            1
557                        2                            1

[558 rows x 7 columns]
     Price_DOLLAR  Accommodation  Number Of Nights  year month  \
558         63.90              4                 2  2019    06
559         63.90              4                 2  2019    06
560         31.95              4                 1  2019    06
561         32.95              4                 1  2019    06
562         63.90              4                 2  2019    06
..            ...            ...               ...   ...   ...
700        327.40              3                 5  2023    07
701        212.25              1                 3  2023    07
702         86.62              2                 2  2023    05
703        100.76              2                 2  2023    09
704        100.76              2                 2  2023    09

     dim_currency_idcurrency  dim_advertiser_idadvertiser
558                        3                            2
559                        3                            2
560                        3                            2
561                        3                            2
562                        3                            2
..                       ...                          ...
700                        3                            2
701                        3                            2
702                        3                            2
703                        3                            2
704                        3                            2

[147 rows x 7 columns]

C:\Users\k\AppData\Local\Temp\ipykernel_13572\1674209646.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Booking['Accommodation'] = data_fact_profit_Booking['Accommodation'].map(accommodation_mapping)
C:\Users\k\AppData\Local\Temp\ipykernel_13572\1674209646.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Airbnb['Accommodation'] = data_fact_profit_Airbnb['Accommodation'].map(accommodation_mapping)
C:\Users\k\AppData\Local\Temp\ipykernel_13572\1674209646.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Booking['dim_currency_idcurrency'] = 2
C:\Users\k\AppData\Local\Temp\ipykernel_13572\1674209646.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Booking['dim_advertiser_idadvertiser'] = 1
C:\Users\k\AppData\Local\Temp\ipykernel_13572\1674209646.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Airbnb['dim_currency_idcurrency'] = 3
C:\Users\k\AppData\Local\Temp\ipykernel_13572\1674209646.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Airbnb['dim_advertiser_idadvertiser'] = 2

In [265]:
def factMonth(df):
    df['month2'] = np.nan
    for index, row in df.iterrows():
        if row['year'] == "2019":
            if row['month'] == "04":
                df.at[index, 'month2'] = 1
            if row['month'] == "05":
                df.at[index, 'month2'] = 2
            if row['month'] == "06":
                df.at[index, 'month2'] = 3
            if row['month'] == "07":
                df.at[index, 'month2'] = 4
            if row['month'] == "08":
                df.at[index, 'month2'] = 5
            if row['month'] == "09":
                df.at[index, 'month2'] = 6
            if row['month'] == "10":
                df.at[index, 'month2'] = 7
        if row['year'] == "2020":        
            if row['month'] == "06":
                df.at[index, 'month2'] = 8
            if row['month'] == "07":
                df.at[index, 'month2'] = 9
            if row['month'] == "08":
                df.at[index, 'month2'] = 10
            if row['month'] == "09":
                df.at[index, 'month2'] = 11
        if row['year'] == "2021":        
            if row['month'] == "02":
                df.at[index, 'month2'] = 12
            if row['month'] == "06":
                df.at[index, 'month2'] = 13
            if row['month'] == "07":
                df.at[index, 'month2'] = 14
            if row['month'] == "08":
                df.at[index, 'month2'] = 15
            if row['month'] == "09":
                df.at[index, 'month2'] = 16
        if row['year'] == "2022":        
            if row['month'] == "01":
                df.at[index, 'month2'] = 17
            if row['month'] == "03":
                df.at[index, 'month2'] = 18
            if row['month'] == "05":
                df.at[index, 'month2'] = 19
            if row['month'] == "06":
                df.at[index, 'month2'] = 20
            if row['month'] == "07":
                df.at[index, 'month2'] = 21
            if row['month'] == "08":
                df.at[index, 'month2'] = 22
            if row['month'] == "09":
                df.at[index, 'month2'] = 23
            if row['month'] == "10":
                df.at[index, 'month2'] = 24
        if row['year'] == "2023":        
            if row['month'] == "01":
                df.at[index, 'month2'] = 26
            if row['month'] == "04":
                df.at[index, 'month2'] = 27
            if row['month'] == "05":
                df.at[index, 'month2'] = 28
            if row['month'] == "06":
                df.at[index, 'month2'] = 29
            if row['month'] == "07":
                df.at[index, 'month2'] = 30
            if row['month'] == "08":
                df.at[index, 'month2'] = 31
            if row['month'] == "09":
                df.at[index, 'month2'] = 32
            if row['month'] == "10":
                df.at[index, 'month2'] = 33
            if row['month'] == "10":
                df.at[index, 'month2'] = 34
    return df

In [290]:
data_fact_profit_Booking = factMonth(data_fact_profit_Booking)
data_fact_profit_Airbnb = factMonth(data_fact_profit_Airbnb)
data_fact_profit_Airbnb

C:\Users\k\AppData\Local\Temp\ipykernel_13572\3904775683.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['month2'] = np.nan
C:\Users\k\AppData\Local\Temp\ipykernel_13572\3904775683.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['month2'] = np.nan

,Price_DOLLAR,Accommodation,Number Of Nights,year,month,dim_currency_idcurrency,dim_advertiser_idadvertiser,month2
558,63.90,4,2,2019,06,3,2,3.0
559,63.90,4,2,2019,06,3,2,3.0
560,31.95,4,1,2019,06,3,2,3.0
561,32.95,4,1,2019,06,3,2,3.0
562,63.90,4,2,2019,06,3,2,3.0
...,...,...,...,...,...,...,...,...
700,327.40,3,5,2023,07,3,2,30.0
701,212.25,1,3,2023,07,3,2,30.0
702,86.62,2,2,2023,05,3,2,28.0
703,100.76,2,2,2023,09,3,2,32.0
704,100.76,2,2,2023,09,3,2,32.0

In [291]:
columns_to_drop = ['year', 'month']
data_fact_profit_Booking.drop(columns=columns_to_drop, inplace=True)
data_fact_profit_Airbnb.drop(columns=columns_to_drop, inplace=True)
data_fact_profit_Airbnb

C:\Users\k\AppData\Local\Temp\ipykernel_13572\425475774.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Booking.drop(columns=columns_to_drop, inplace=True)
C:\Users\k\AppData\Local\Temp\ipykernel_13572\425475774.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Airbnb.drop(columns=columns_to_drop, inplace=True)

,Price_DOLLAR,Accommodation,Number Of Nights,dim_currency_idcurrency,dim_advertiser_idadvertiser,month2
558,63.90,4,2,3,2,3.0
559,63.90,4,2,3,2,3.0
560,31.95,4,1,3,2,3.0
561,32.95,4,1,3,2,3.0
562,63.90,4,2,3,2,3.0
...,...,...,...,...,...,...
700,327.40,3,5,3,2,30.0
701,212.25,1,3,3,2,30.0
702,86.62,2,2,3,2,28.0
703,100.76,2,2,3,2,32.0
704,100.76,2,2,3,2,32.0

In [292]:
new_column_names = {'Price_EUR': 'profit',
                    'Price_DOLLAR': 'profit',  
                    'Accommodation': 'dim_apartment_idapartment', 
                    'Number Of Nights': 'nights', 
                    'month2': 'dim_tmonth_id_tmonth'}
data_fact_profit_Booking.rename(columns=new_column_names, inplace=True)
data_fact_profit_Airbnb.rename(columns=new_column_names, inplace=True)
data_fact_profit_Airbnb

C:\Users\k\AppData\Local\Temp\ipykernel_13572\712596028.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Booking.rename(columns=new_column_names, inplace=True)
C:\Users\k\AppData\Local\Temp\ipykernel_13572\712596028.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_fact_profit_Airbnb.rename(columns=new_column_names, inplace=True)

,profit,dim_apartment_idapartment,nights,dim_currency_idcurrency,dim_advertiser_idadvertiser,dim_tmonth_id_tmonth
558,63.90,4,2,3,2,3.0
559,63.90,4,2,3,2,3.0
560,31.95,4,1,3,2,3.0
561,32.95,4,1,3,2,3.0
562,63.90,4,2,3,2,3.0
...,...,...,...,...,...,...
700,327.40,3,5,3,2,30.0
701,212.25,1,3,3,2,30.0
702,86.62,2,2,3,2,28.0
703,100.76,2,2,3,2,32.0
704,100.76,2,2,3,2,32.0

In [298]:
data_fact_profit_Booking.shape

(558, 6)

In [294]:
data_fact_profit_Airbnb.shape

(147, 6)

In [ ]:
# pre merga

In [350]:
oltp_reservation_fact_profit = read('reservation')

In [351]:
oltp_reservation_fact_profit

    id_res  total_price start_date   end_date  apartment_id_app  guest_id_u
0        6         9000 2023-09-26 2023-09-28                 1           1
1        7         5000 2023-06-05 2023-06-08                 2           1
2        8         3000 2023-08-10 2023-08-14                 2           1
3        9         2500 2022-10-01 2022-10-06                 2           1
4       10         7000 2021-07-22 2021-07-28                 2           1
5       11         6500 2019-04-16 2019-04-19                 2           1
6       12         4200 2019-04-11 2019-04-15                 3           1
7       13         6700 2019-10-22 2019-10-24                 3           1
8       14         3200 2020-08-06 2020-08-09                 3           1
9       15         9500 2022-09-28 2022-09-30                 3           1
10      16        11400 2023-06-05 2023-06-06                 3           1
11      17         5500 2021-02-05 2021-02-17                 4           1
12      18         6900 2021-07-15 2021-07-18                 4           1
13      19        11000 2019-05-11 2019-05-15                 4           1
14      20         7000 2023-10-22 2023-10-24                 4           1
15      21         4000 2022-01-23 2022-01-25                 4           1
16       1         3000 2022-01-01 2022-01-02                 1           1
17       2        12000 2021-02-02 2021-02-05                 1           1
18       3         7000 2022-03-03 2022-03-05                 1           1
19       4         5000 2023-01-05 2023-01-08                 1           1
20       5         9000 2023-01-26 2023-01-28                 1           1

In [355]:
oltp_reservation_fact_profit['start_date'] = pd.to_datetime(oltp_reservation_fact_profit['start_date'], format='%d.%m.%Y')
oltp_reservation_fact_profit['end_date'] = pd.to_datetime(oltp_reservation_fact_profit['end_date'], format='%d.%m.%Y')
oltp_reservation_fact_profit['nights'] = (oltp_reservation_fact_profit['end_date'] - oltp_reservation_fact_profit['start_date']).dt.days
oltp_reservation_fact_profit

,id_res,total_price,start_date,end_date,apartment_id_app,guest_id_u,nights
0,6,9000,2023-09-26,2023-09-28,1,1,2
1,7,5000,2023-06-05,2023-06-08,2,1,3
2,8,3000,2023-08-10,2023-08-14,2,1,4
3,9,2500,2022-10-01,2022-10-06,2,1,5
4,10,7000,2021-07-22,2021-07-28,2,1,6
5,11,6500,2019-04-16,2019-04-19,2,1,3
6,12,4200,2019-04-11,2019-04-15,3,1,4
7,13,6700,2019-10-22,2019-10-24,3,1,2
8,14,3200,2020-08-06,2020-08-09,3,1,3
9,15,9500,2022-09-28,2022-09-30,3,1,2
10,16,11400,2023-06-05,2023-06-06,3,1,1
11,17,5500,2021-02-05,2021-02-17,4,1,12
12,18,6900,2021-07-15,2021-07-18,4,1,3
13,19,11000,2019-05-11,2019-05-15,4,1,4
14,20,7000,2023-10-22,2023-10-24,4,1,2
15,21,4000,2022-01-23,2022-01-25,4,1,2
16,1,3000,2022-01-01,2022-01-02,1,1,1
17,2,12000,2021-02-02,2021-02-05,1,1,3
18,3,7000,2022-03-03,2022-03-05,1,1,2
19,4,5000,2023-01-05,2023-01-08,1,1,3
20,5,9000,2023-01-26,2023-01-28,1,1,2

In [356]:
columns_to_convert = ['start_date', 'end_date']
oltp_reservation_fact_profit[columns_to_convert] = oltp_reservation_fact_profit[columns_to_convert].astype(str)

In [357]:
oltp_reservation_fact_profit['year'] = oltp_reservation_fact_profit['start_date'].astype(str).str[:4]
oltp_reservation_fact_profit['month'] = oltp_reservation_fact_profit['start_date'].astype(str).str[5:7]
oltp_reservation_fact_profit

,id_res,total_price,start_date,end_date,apartment_id_app,guest_id_u,nights,year,month
0,6,9000,2023-09-26,2023-09-28,1,1,2,2023,09
1,7,5000,2023-06-05,2023-06-08,2,1,3,2023,06
2,8,3000,2023-08-10,2023-08-14,2,1,4,2023,08
3,9,2500,2022-10-01,2022-10-06,2,1,5,2022,10
4,10,7000,2021-07-22,2021-07-28,2,1,6,2021,07
5,11,6500,2019-04-16,2019-04-19,2,1,3,2019,04
6,12,4200,2019-04-11,2019-04-15,3,1,4,2019,04
7,13,6700,2019-10-22,2019-10-24,3,1,2,2019,10
8,14,3200,2020-08-06,2020-08-09,3,1,3,2020,08
9,15,9500,2022-09-28,2022-09-30,3,1,2,2022,09
10,16,11400,2023-06-05,2023-06-06,3,1,1,2023,06
11,17,5500,2021-02-05,2021-02-17,4,1,12,2021,02
12,18,6900,2021-07-15,2021-07-18,4,1,3,2021,07
13,19,11000,2019-05-11,2019-05-15,4,1,4,2019,05
14,20,7000,2023-10-22,2023-10-24,4,1,2,2023,10
15,21,4000,2022-01-23,2022-01-25,4,1,2,2022,01
16,1,3000,2022-01-01,2022-01-02,1,1,1,2022,01
17,2,12000,2021-02-02,2021-02-05,1,1,3,2021,02
18,3,7000,2022-03-03,2022-03-05,1,1,2,2022,03
19,4,5000,2023-01-05,2023-01-08,1,1,3,2023,01
20,5,9000,2023-01-26,2023-01-28,1,1,2,2023,01

In [358]:
columns_to_drop = ['id_res', 'start_date', 'end_date', 'guest_id_u']
oltp_reservation_fact_profit.drop(columns=columns_to_drop, inplace=True)
oltp_reservation_fact_profit

    total_price  apartment_id_app  nights  year month
0          9000                 1       2  2023    09
1          5000                 2       3  2023    06
2          3000                 2       4  2023    08
3          2500                 2       5  2022    10
4          7000                 2       6  2021    07
5          6500                 2       3  2019    04
6          4200                 3       4  2019    04
7          6700                 3       2  2019    10
8          3200                 3       3  2020    08
9          9500                 3       2  2022    09
10        11400                 3       1  2023    06
11         5500                 4      12  2021    02
12         6900                 4       3  2021    07
13        11000                 4       4  2019    05
14         7000                 4       2  2023    10
15         4000                 4       2  2022    01
16         3000                 1       1  2022    01
17        12000                 1       3  2021    02
18         7000                 1       2  2022    03
19         5000                 1       3  2023    01
20         9000                 1       2  2023    01

In [359]:
oltp_reservation_fact_profit['dim_currency_idcurrency'] = 1
oltp_reservation_fact_profit['dim_advertiser_idadvertiser'] = 3
oltp_reservation_fact_profit

,total_price,apartment_id_app,nights,year,month,dim_currency_idcurrency,dim_advertiser_idadvertiser
0,9000,1,2,2023,09,1,3
1,5000,2,3,2023,06,1,3
2,3000,2,4,2023,08,1,3
3,2500,2,5,2022,10,1,3
4,7000,2,6,2021,07,1,3
5,6500,2,3,2019,04,1,3
6,4200,3,4,2019,04,1,3
7,6700,3,2,2019,10,1,3
8,3200,3,3,2020,08,1,3
9,9500,3,2,2022,09,1,3
10,11400,3,1,2023,06,1,3
11,5500,4,12,2021,02,1,3
12,6900,4,3,2021,07,1,3
13,11000,4,4,2019,05,1,3
14,7000,4,2,2023,10,1,3
15,4000,4,2,2022,01,1,3
16,3000,1,1,2022,01,1,3
17,12000,1,3,2021,02,1,3
18,7000,1,2,2022,03,1,3
19,5000,1,3,2023,01,1,3
20,9000,1,2,2023,01,1,3

In [360]:
oltp_reservation_fact_profit = factMonth(oltp_reservation_fact_profit)
oltp_reservation_fact_profit

,total_price,apartment_id_app,nights,year,month,dim_currency_idcurrency,dim_advertiser_idadvertiser,month2
0,9000,1,2,2023,09,1,3,32.0
1,5000,2,3,2023,06,1,3,29.0
2,3000,2,4,2023,08,1,3,31.0
3,2500,2,5,2022,10,1,3,24.0
4,7000,2,6,2021,07,1,3,14.0
5,6500,2,3,2019,04,1,3,1.0
6,4200,3,4,2019,04,1,3,1.0
7,6700,3,2,2019,10,1,3,7.0
8,3200,3,3,2020,08,1,3,10.0
9,9500,3,2,2022,09,1,3,23.0
10,11400,3,1,2023,06,1,3,29.0
11,5500,4,12,2021,02,1,3,12.0
12,6900,4,3,2021,07,1,3,14.0
13,11000,4,4,2019,05,1,3,2.0
14,7000,4,2,2023,10,1,3,34.0
15,4000,4,2,2022,01,1,3,17.0
16,3000,1,1,2022,01,1,3,17.0
17,12000,1,3,2021,02,1,3,12.0
18,7000,1,2,2022,03,1,3,18.0
19,5000,1,3,2023,01,1,3,26.0
20,9000,1,2,2023,01,1,3,26.0

In [361]:
columns_to_drop = ['year', 'month']
oltp_reservation_fact_profit.drop(columns=columns_to_drop, inplace=True)
oltp_reservation_fact_profit

,total_price,apartment_id_app,nights,dim_currency_idcurrency,dim_advertiser_idadvertiser,month2
0,9000,1,2,1,3,32.0
1,5000,2,3,1,3,29.0
2,3000,2,4,1,3,31.0
3,2500,2,5,1,3,24.0
4,7000,2,6,1,3,14.0
5,6500,2,3,1,3,1.0
6,4200,3,4,1,3,1.0
7,6700,3,2,1,3,7.0
8,3200,3,3,1,3,10.0
9,9500,3,2,1,3,23.0
10,11400,3,1,1,3,29.0
11,5500,4,12,1,3,12.0
12,6900,4,3,1,3,14.0
13,11000,4,4,1,3,2.0
14,7000,4,2,1,3,34.0
15,4000,4,2,1,3,17.0
16,3000,1,1,1,3,17.0
17,12000,1,3,1,3,12.0
18,7000,1,2,1,3,18.0
19,5000,1,3,1,3,26.0
20,9000,1,2,1,3,26.0

In [362]:
new_column_names = {'total_price': 'profit',
                    'apartment_id_app': 'dim_apartment_idapartment', 
                    'month2': 'dim_tmonth_id_tmonth'}
oltp_reservation_fact_profit.rename(columns=new_column_names, inplace=True)
oltp_reservation_fact_profit

,profit,dim_apartment_idapartment,nights,dim_currency_idcurrency,dim_advertiser_idadvertiser,dim_tmonth_id_tmonth
0,9000,1,2,1,3,32.0
1,5000,2,3,1,3,29.0
2,3000,2,4,1,3,31.0
3,2500,2,5,1,3,24.0
4,7000,2,6,1,3,14.0
5,6500,2,3,1,3,1.0
6,4200,3,4,1,3,1.0
7,6700,3,2,1,3,7.0
8,3200,3,3,1,3,10.0
9,9500,3,2,1,3,23.0
10,11400,3,1,1,3,29.0
11,5500,4,12,1,3,12.0
12,6900,4,3,1,3,14.0
13,11000,4,4,1,3,2.0
14,7000,4,2,1,3,34.0
15,4000,4,2,1,3,17.0
16,3000,1,1,1,3,17.0
17,12000,1,3,1,3,12.0
18,7000,1,2,1,3,18.0
19,5000,1,3,1,3,26.0
20,9000,1,2,1,3,26.0

In [364]:
mergedFactProfit = pd.concat([data_fact_profit_Booking, data_fact_profit_Airbnb, oltp_reservation_fact_profit], ignore_index=True)

In [369]:
mergedFactProfit.shape

(726, 6)

In [370]:
mergedFactProfit['idprofit'] = range(1, len(mergedFactProfit) + 1)
mergedFactProfit

,profit,dim_apartment_idapartment,nights,dim_currency_idcurrency,dim_advertiser_idadvertiser,dim_tmonth_id_tmonth,idprofit
0,95.94,1,3,2,1,1.0,1
1,164.00,1,5,2,1,1.0,2
2,31.98,2,1,2,1,1.0,3
3,31.98,3,1,2,1,1.0,4
4,32.80,2,1,2,1,1.0,5
...,...,...,...,...,...,...,...
721,3000.00,1,1,1,3,17.0,722
722,12000.00,1,3,1,3,12.0,723
723,7000.00,1,2,1,3,18.0,724
724,5000.00,1,3,1,3,26.0,725
725,9000.00,1,2,1,3,26.0,726

In [371]:
new_column_order = ['idprofit', 'nights', 'profit', 'dim_advertiser_idadvertiser', 'dim_tmonth_id_tmonth', 'dim_apartment_idapartment', 'dim_currency_idcurrency']
mergedFactProfit = mergedFactProfit[new_column_order]
mergedFactProfit

,idprofit,nights,profit,dim_advertiser_idadvertiser,dim_tmonth_id_tmonth,dim_apartment_idapartment,dim_currency_idcurrency
0,1,3,95.94,1,1.0,1,2
1,2,5,164.00,1,1.0,1,2
2,3,1,31.98,1,1.0,2,2
3,4,1,31.98,1,1.0,3,2
4,5,1,32.80,1,1.0,2,2
...,...,...,...,...,...,...,...
721,722,1,3000.00,3,17.0,1,1
722,723,3,12000.00,3,12.0,1,1
723,724,2,7000.00,3,18.0,1,1
724,725,3,5000.00,3,26.0,1,1
725,726,2,9000.00,3,26.0,1,1

In [372]:
data_fact_profit_to_list = list(mergedFactProfit.itertuples(index=False, name=None))
query_insert_data_fact_profit = """   INSERT INTO fact_profit (idprofit, nights, profit, dim_advertiser_idadvertiser, dim_tmonth_id_tmonth, dim_apartment_idapartment, dim_currency_idcurrency) 
                                                        VALUES (:1, :2, :3, :4, :5, :6, :7)"""
write(data_fact_profit_to_list, query_insert_data_fact_profit)